#Область ФормированиеМетаданных

&НаСервере
Функция ОбъектыМетаданных(ТипМетаданных) Экспорт
	ОбъектыМетаданных = Новый Массив;
	
	Если ТипМетаданных = "Справочник" Тогда
		Для каждого Справочник из Метаданные.Справочники Цикл
			ОбъектыМетаданных.Добавить(Справочник.ПолноеИмя());
		КонецЦикла;
	ИначеЕсли ТипМетаданных = "Документ" Тогда
		Для каждого Документ из Метаданные.Документы Цикл
			ОбъектыМетаданных.Добавить(Документ.ПолноеИмя());
		КонецЦикла;
	ИначеЕсли ТипМетаданных = "Перечисление" Тогда
		Для каждого Перечисление из Метаданные.Перечисления Цикл
			ОбъектыМетаданных.Добавить(Перечисление.ПолноеИмя());
		КонецЦикла;
	ИначеЕсли ТипМетаданных = "План видов характеристик" Тогда
		Для каждого ПВХ из Метаданные.ПланыВидовХарактеристик Цикл
			ОбъектыМетаданных.Добавить(ПВХ.ПолноеИмя());
		КонецЦикла;
	ИначеЕсли ТипМетаданных = "Регистр сведений" Тогда
		Для каждого Сведения из Метаданные.РегистрыСведений Цикл
			ОбъектыМетаданных.Добавить(Сведения.ПолноеИмя());
		КонецЦикла;
	ИначеЕсли ТипМетаданных = "Регистр накопления" Тогда
		Для каждого Накопления из Метаданные.РегистрыНакопления Цикл
			ОбъектыМетаданных.Добавить(Накопления.ПолноеИмя());
		КонецЦикла;
	КонецЕсли;
	
	Возврат ОбъектыМетаданных;
	
КонецФункции

&НаСервере
Функция РеквизитыОбъектаМетаданных(ТипМетаданных, ОбъектМетаданных, Тип, Вид) Экспорт
	
	Если Вид = "Ресурсы" Тогда
		СписокРесурсов = Новый СписокЗначений;

		Ресурсы = Метаданные.НайтиПоПолномуИмени(ОбъектМетаданных).Ресурсы;
		Для каждого Ресурс из Ресурсы Цикл
			СписокРесурсов.Добавить(Ресурс.Имя, Строка(Ресурс.Тип));
		КонецЦикла;
		Возврат СписокРесурсов;
	ИначеЕсли Вид = "Измерения" Тогда
		СписокИзмерений = Новый СписокЗначений;
		Измерения = Метаданные.НайтиПоПолномуИмени(ОбъектМетаданных).Измерения;
		
		Для Каждого Измерение из Измерения Цикл
			СписокИзмерений.Добавить(Измерение.Имя, Строка(Измерение.Тип));
		КонецЦикла;
		Возврат СписокИзмерений
	Иначе
		СписокРеквизитов = Новый СписокЗначений;
		Реквизиты = Метаданные.НайтиПоПолномуИмени(ОбъектМетаданных).Реквизиты;
	
		Для каждого Реквизит из Реквизиты Цикл
			СписокРеквизитов.Добавить(Реквизит.Имя, Строка(Реквизит.Тип));
		КонецЦикла;
		Если ТипМетаданных = "Регистр сведений" ИЛИ ТипМетаданных = "Регистр накопления" Тогда
			Возврат СписокРеквизитов;
		Иначе
			СписокРеквизитов.Добавить("Ссылка", ОбъектМетаданных+"."+"Ссылка");
			Возврат СписокРеквизитов;
		КонецЕсли;
		
		
		
	КонецЕсли;
	
	
	
	
	
	

КонецФункции

#КонецОбласти 

#Область РаботаСЗапросом

&НаСервере
Функция СформироватьОтчет(
	ТипМетаданных, 
	ОбъектМетаданных, 
	Реквизиты, 
	Группировки = Неопределено, 
	Параметры = Неопределено, 
	Итоги = "", 
	ИтогиПо = Неопределено, 
	Порядок = Неопределено, 
	ВиртуальнаяТаблица = Неопределено, 
	ДатаРегистра = Неопределено
) Экспорт
	
	ПсевдонимГлавнойТаблицы = Неопределено;
	ПсевдонимВиртуальнойТаблицы = Неопределено;
	Если ЗначениеЗаполнено(ВиртуальнаяТаблица) Тогда 
		ПсевдонимГлавнойТаблицы = "ГлавнаяТаблица";
		ПсевдонимВиртуальнойТаблицы = "ВиртуальнаяТаблица";
	КонецЕсли;
	
	Выбрать = СтрокаВыбрать(
		Реквизиты, 
		ТипМетаданных, 
		ВиртуальнаяТаблица, 
		ОбъектМетаданных, 
		ПсевдонимГлавнойТаблицы, 
		ПсевдонимВиртуальнойТаблицы
	); 
	
	ТекстВыбрать = Выбрать[0];
	СоединенияПоИзмерениям = Выбрать[1]; 
	
	ОтветИз = СтрокаИз(
		ОбъектМетаданных, 
		ВиртуальнаяТаблица, 
		ДатаРегистра, 
		СоединенияПоИзмерениям, 
		ПсевдонимГлавнойТаблицы, 
		ПсевдонимВиртуальнойТаблицы
	);
	
	ТекстИз = ОтветИз[0];
	
	Попытка
		ПараметрыРегистров = ОтветИз[1];
	Исключение
		ПараметрыРегистров = Неопределено;
	КонецПопытки;
	СтрокиГдеИз = СтрокаГде(
		Параметры, 
		ОбъектМетаданных, 
		ПараметрыРегистров, 
		ВиртуальнаяТаблица, 
		ПсевдонимГлавнойТаблицы, 
		ПсевдонимВиртуальнойТаблицы
	);
	ДополненныйТекстИз = СтрокиГдеИз[1];
	Если ЗначениеЗаполнено(ДополненныйТекстИз) Тогда 
		ТекстИз = ТекстИз  + ДополненныйТекстИз;
	КонецЕсли;
	ТекстГде = СтрокиГдеИз[0];
	Запрос = СтрокиГдеИз[2];
	ТекстСгруппироватьПо = СтрокаСгруппироватьПо(
		Группировки, 
		ПсевдонимГлавнойТаблицы, 
		ПсевдонимВиртуальнойТаблицы, 
		ОбъектМетаданных
	);
	ТекстИтоги = СтрокаИтоги(Итоги);
	ТекстПо = СтрокаПо(
		ИтогиПо, 
		ПсевдонимГлавнойТаблицы, 
		ПсевдонимВиртуальнойТаблицы, 
		ОбъектМетаданных
	);
	ТекстПорядок = СтрокаПорядок(
		Порядок, 
		Реквизиты, 
		ПсевдонимГлавнойТаблицы, 
		ПсевдонимВиртуальнойТаблицы, 
		ОбъектМетаданных
	);
	

	Запрос.Текст = ТекстВыбрать + ТекстИз + ТекстГде + ТекстСгруппироватьПо  + ТекстПорядок + ТекстИтоги + ТекстПо;
		
	Выбрать = Новый Соответствие;
	Попытка
		Данные = Запрос.Выполнить().Выгрузить();
		ТабличныйДокумент = ТабличныйДокумент(Данные);
		Выбрать.Вставить("ТабличныйДокумент", ТабличныйДокумент);
		Выбрать.Вставить("Ошибка", Неопределено);
	Исключение
		Ошибка = ОписаниеОшибки();
		Ошибка = ОшибкаДляПользователя(Ошибка);
		Выбрать.Вставить("ТабличныйДокумент", Неопределено);
		Выбрать.Вставить("Ошибка", Ошибка);
	КонецПопытки;
			
	Возврат Выбрать;
		
КонецФункции

&НаСервере
Функция ТабличныйДокумент(Данные)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	СтрокаЗаголовка = 1;
	НомерКолонки = 1;
	
	Для каждого Колонка из Данные.Колонки Цикл
		ТабличныйДокумент.Область(СтрокаЗаголовка, НомерКолонки).Текст = Колонка.Имя;
		НомерКолонки = НомерКолонки + 1;
	КонецЦикла;
	
	НомерСтроки = 2;
	Для каждого СтрокаДанных Из Данные Цикл
		НомерКолонки = 1;
		Для Каждого Колонка из Данные.Колонки Цикл
			ТабличныйДокумент.Область(НомерСтроки, НомерКолонки).Текст = СтрокаДанных[Колонка.Имя];
			НомерКолонки = НомерКолонки + 1;
		КонецЦикла;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	ТабличныйДокумент.УстановитьРастягиваниеПоГоризонтали(Истина);
	Возврат ТабличныйДокумент;
КонецФункции

#КонецОбласти 

#Область СтрокиДляЗапроса

&НаСервере
Функция СтрокаВыбрать(
	Реквизиты, 
	ТипМетаданных, 
	ВиртуальнаяТаблица, 
	ОбъектМетаданных, 
	Главная, 
	Виртуальная
)
	Если Главная = Неопределено ИЛИ Виртуальная = Неопределено Тогда
		Главная = ОбъектМетаданных;
	КонецЕсли;
		
	ВиртуальнаяТаблицаФормально = "";
	Если ВиртуальнаяТаблица = "Остаток" Тогда
		ВиртуальнаяТаблицаФормально = "Остатки";
	ИначеЕсли ВиртуальнаяТаблица = "Оборот" Тогда
		ВиртуальнаяТаблицаФормально = "Обороты";
	ИначеЕсли ВиртуальнаяТаблица = "СрезПоследних" Тогда
		ВиртуальнаяТаблицаФормально = "СрезПоследних";
	ИначеЕсли ВиртуальнаяТаблица = "СрезПервых" Тогда
		ВиртуальнаяТаблицаФормально = "СрезПервых";
	Иначе
		ВиртуальнаяТаблицаФормально = "ОстаткиИОбороты";
	КонецЕсли;
	
	Ответ = Новый Массив;
	ТекстВыбрать =  "ВЫБРАТЬ" + Символы.ПС;
	РазныеТаблицы = Ложь;
	КоличествоСоединенийПоИзмерениям = 0;
	Текст = "";
	
		Если ТипМетаданных <> "Перечисление" Тогда 
			КоличествоРеквизитов = Реквизиты.Количество();
			Для каждого Реквизит из Реквизиты Цикл
				Если ЗначениеЗаполнено(ВиртуальнаяТаблица) Тогда
					ЕстьЛиАгрегация = СтрНайти(Реквизит, "(");
					Агрегация = "";
					Если ЕстьЛиАгрегация > 0 Тогда
						Агрегация = Лев(Реквизит, ЕстьЛиАгрегация);
					КонецЕсли;
					СтрокаМассив = СтрРазделить(Реквизит, "."); 
					Имя = СтрокаМассив.Получить(СтрокаМассив.Количество() - 1);
					Объект = Метаданные.НайтиПоПолномуИмени(ОбъектМетаданных);
					ЕстьЛиПсевдоним = СтрНайти(Имя, "КАК");
					Если ЕстьЛиПсевдоним <> 0 Тогда
						Имя = Лев(Имя, ЕстьЛиПсевдоним - 2);
					КонецЕсли;
					Если Объект.Измерения.Найти(Имя) <> Неопределено Тогда 
						Если ВиртуальнаяТаблица = "Остаток" ИЛИ  ВиртуальнаяТаблица = "СрезПоследних" Тогда
							Если КоличествоСоединенийПоИзмерениям = 0 Тогда
								Текст = "ИЗ" + Символы.ПС + "    " + ОбъектМетаданных +"."+ ВиртуальнаяТаблицаФормально+ "(&ДатаКонцаРегистра, )" + " КАК " + Виртуальная + Символы.ПС +  "    ЛЕВОЕ СОЕДИНЕНИЕ " + ОбъектМетаданных + " КАК " + Главная + Символы.ПС +"        ПО " + Виртуальная + "." + Имя + " = " + Главная + "." + Имя + Символы.ПС;
								КоличествоСоединенийПоИзмерениям = 1;
							Иначе
								Текст = Текст + "        И "+ "ВиртуальнаяТаблица" + "." + Имя + " = " + "ГлавнаяТаблица" + "." + Имя + Символы.ПС;
							КонецЕсли;	
						Иначе
							Если КоличествоСоединенийПоИзмерениям = 0 Тогда
								Текст = "ИЗ" + Символы.ПС + "    " + ОбъектМетаданных +"."+ ВиртуальнаяТаблицаФормально+ "(&ДатаНачалаРегистра, &ДатаКонцаРегистра, )" + " КАК " + Виртуальная + Символы.ПС +  "    ЛЕВОЕ СОЕДИНЕНИЕ " + ОбъектМетаданных + " КАК " + Главная + Символы.ПС +"        ПО " + Виртуальная + "." + Имя + " = " + Главная + "." + Имя + Символы.ПС;
								КоличествоСоединенийПоИзмерениям = 1;
							Иначе
								Текст = Текст + "        И "+ "ВиртуальнаяТаблица" + "." + Имя + " = " + "ГлавнаяТаблица" + "." + Имя + Символы.ПС;
							КонецЕсли;
						КонецЕсли
						
					КонецЕсли;
				КонецЕсли;
					ЕстьЛиАгрегация = СтрНайти(Реквизит, "(");
					Агрегация = "";
					Если ЕстьЛиАгрегация > 0 Тогда
						Агрегация = Лев(Реквизит, ЕстьЛиАгрегация);
					КонецЕсли;
					СтрокаМассив = СтрРазделить(Реквизит, ".");
					Количество = СтрокаМассив.Количество();
					Имя = СтрокаМассив.Получить(СтрокаМассив.Количество() - 1);
					ЕстьЛиПсевдоним = СтрНайти(Имя, "КАК");
					Если СтрНайти(Имя, "КАК") <> 0 Тогда
						Имя = Лев(Имя, ЕстьЛиПсевдоним - 2);
					КонецЕсли;

					Если Количество > 3 Тогда
						Если НЕ ЗначениеЗаполнено(Агрегация) Тогда
							Если Реквизит = Реквизиты[КоличествоРеквизитов - 1] Тогда 
								Реквизит = "    " + Агрегация+Виртуальная + "." + Имя + Символы.ПС;
							Иначе
								Реквизит = "    " + Агрегация+ Виртуальная + "." + Имя  + "," + Символы.ПС;
							КонецЕсли;
							ТекстВыбрать = ТекстВыбрать + Реквизит;
						Иначе
							МассивСПсевдонимом = СтрРазделить(Реквизит, " ");
							Псевдоним = МассивСПсевдонимом[2]; 
							Если Реквизит = Реквизиты[КоличествоРеквизитов - 1] Тогда 
								Реквизит = "    " + Агрегация+Виртуальная + "." + Имя + " КАК " +Псевдоним+  Символы.ПС;
							Иначе
								Реквизит = "    " + Агрегация+ Виртуальная + "." + Имя  + " КАК " +Псевдоним+ "," + Символы.ПС;
							КонецЕсли;
							ТекстВыбрать = ТекстВыбрать + Реквизит;
						КонецЕсли;
					Иначе
						Если НЕ ЗначениеЗаполнено(Агрегация) Тогда
							Если Реквизит = Реквизиты[КоличествоРеквизитов - 1] Тогда 
								Реквизит = "    " +Агрегация+ Главная + "." + Имя + Символы.ПС;
							Иначе
								Реквизит = "    "+Агрегация +Главная + "." + Имя  + "," + Символы.ПС;
							КонецЕсли;
							ТекстВыбрать = ТекстВыбрать + Реквизит;
						Иначе
							МассивСПсевдонимом = СтрРазделить(Реквизит, " ");
							Псевдоним = МассивСПсевдонимом[2]; 
							Если Реквизит = Реквизиты[КоличествоРеквизитов - 1] Тогда 
								Реквизит = "    " +Агрегация+ Главная + "." + Имя + " КАК " +Псевдоним+Символы.ПС;
							Иначе
								Реквизит = "    "+Агрегация +Главная + "." + Имя  + " КАК " +Псевдоним+ "," + Символы.ПС;
							КонецЕсли;
							ТекстВыбрать = ТекстВыбрать + Реквизит;
						КонецЕсли;
						
					КонецЕсли;
			КонецЦикла;
	Иначе
		ТекстВыбрать = ТекстВыбрать + "    *" + Символы.ПС;
	КонецЕсли;
	Ответ.Добавить(ТекстВыбрать);
	Ответ.Добавить(Текст);
	Возврат Ответ;
КонецФункции

&НаСервере
Функция СтрокаИз(ОбъектМетаданных, ВиртуальнаяТаблица, ПараметрыДляРегистра, СоединенияПоИзмерениям = "", Главная, Виртуальная)
	Ответ = Новый Массив;
	Если Главная = Неопределено ИЛИ Виртуальная = Неопределено Тогда
		Главная = ОбъектМетаданных;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВиртуальнаяТаблица) Тогда
			ТекстИз = "ИЗ" + Символы.ПС + "    " + ОбъектМетаданных + Символы.ПС;
			Ответ.Добавить(ТекстИз);
		
		
	Иначе
		КоличествоПараметров = ПараметрыДляРегистра.Количество();
		Соответствие = Новый Массив;
		Если ЗначениеЗаполнено(СоединенияПоИзмерениям) Тогда  
			Если КоличествоПараметров > 1 Тогда
				 
				ТекстИз = СоединенияПоИзмерениям; //ТекстИз = "ИЗ" + Символы.ПС + "    " + ОбъектМетаданных + "." + ВиртуальнаяТаблица + "(&ДатаНачалаРегистра, &ДатаКонцаРегистра, )" + Символы.ПС;
				Соответствие.Добавить(ПараметрыДляРегистра[0]);
				Соответствие.Добавить(ПараметрыДляРегистра[1]);
			
				
			КонецЕсли;
		Иначе
			Если КоличествоПараметров > 1 Тогда
				Если ВиртуальнаяТаблица <> "Остаток" Тогда 
					ТекстИз = "ИЗ" + Символы.ПС + "    " + ОбъектМетаданных + "." + ВиртуальнаяТаблица + "(&ДатаНачалаРегистра, &ДатаКонцаРегистра, )" + " КАК "  + Виртуальная + Символы.ПС;
					Соответствие.Добавить(ПараметрыДляРегистра[0]);

					Соответствие.Добавить(ПараметрыДляРегистра[1]);
				Иначе
					ТекстИз = "ИЗ" + Символы.ПС + "    " + ОбъектМетаданных + "." + ВиртуальнаяТаблица + "(&ДатаКонцаРегистра,  )" + " КАК "  + Виртуальная + Символы.ПС;
					Соответствие.Добавить(ПараметрыДляРегистра[1]);
				КонецЕсли
			
			КонецЕсли;	
		КонецЕсли;
		Ответ.Добавить(ТекстИз);
		Ответ.Добавить(Соответствие);

	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция СтрокаГде(Параметры,ОбъектМетаданных, ПараметрыРегистров, ВиртуальнаяТаблица = "", Главная, Виртуальная) 
	Если Главная = Неопределено ИЛИ Виртуальная = Неопределено Тогда
		Главная = ОбъектМетаданных;
	КонецЕсли;
	Запрос = Новый Запрос;
	Если ПараметрыРегистров <> Неопределено Тогда
		Если ПараметрыРегистров.Количество() <> 0 Тогда
			Если ПараметрыРегистров.Количество() > 1 Тогда
				Если ВиртуальнаяТаблица <> "Остаток" ИЛИ ВиртуальнаяТаблица <> "СрезПоследних" Тогда
					Запрос.УстановитьПараметр("ДатаНачалаРегистра", ПараметрыРегистров[0]);
					Запрос.УстановитьПараметр("ДатаКонцаРегистра", ПараметрыРегистров[1]);
				Иначе
					Запрос.УстановитьПараметр("ДатаКонцаРегистра", ПараметрыРегистров[0]);
				КонецЕсли;
			Иначе
				Запрос.УстановитьПараметр("ДатаКонцаРегистра", ПараметрыРегистров[1]);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	ТекстГде = "";
	ТекстИз = "";
	НужноеКоличествоПараметров = 1;
	Если Параметры <> Неопределено Тогда
		КоличествоПараметров = Параметры.Количество();
		Если КоличествоПараметров <> 0  Тогда
		
		
			// создается соответствие(1, "Параметр1"), (2, "Параметр2")
			// для установки параметров в запрос по ключу
			Соответствие = Новый Соответствие;
			Количество = 0;
			Для Каждого Параметр из Параметры Цикл
				Для Каждого Элемент из Параметр Цикл
					Попытка
						СтроковыйТипЗначения = Строка(Тип(Элемент.Значение));
						Количество = Количество + 2;
					Исключение
						Количество = Количество + 1;
					КонецПопытки;
				КонецЦикла;
			КонецЦикла;
			Для НужноеКоличествоПараметров = 1 По Количество Цикл
				Соответствие.Вставить(НужноеКоличествоПараметров, "Параметр"+Строка(НужноеКоличествоПараметров));
			КонецЦикла;
			
			ИндексПроверкиНаТип = 1;
			ИндексПараметра = 1;
			ТекстГде = "ГДЕ" + Символы.ПС;
			Для каждого Параметр из Параметры Цикл
				// перебирается каждый параметр из массива параметров
				// элемент из этого массива представляет собой соответствие
				// где ключ - это имя параметра (Справочник.Контрагенты.ИНН)
				// а значение - это значение параметра (123456789000)
				
				Для каждого Элемент из Параметр Цикл
					
					ПолноеИмя = Элемент.Ключ;
					
					Попытка
						СтроковыйТипЗначения = Строка(Тип(Элемент.Значение));
						Если СтроковыйТипЗначения = "Массив" Тогда 
							
							Запрос.УстановитьПараметр(Соответствие.Получить(ИндексПараметра), Элемент.Значение[0]);
							Запрос.УстановитьПараметр(Соответствие.Получить(ИндексПараметра + 1), Элемент.Значение[1]);
						КонецЕсли;
					Исключение
						Запрос.УстановитьПараметр(Соответствие.Получить(ИндексПараметра), Элемент.Значение); // Запрос.УстановитьПараметр("Параметр1", 123456789000)							 
						ТекстИзССоединениями = СоединениеВТекстеИз(Параметр, ОбъектМетаданных, ТекстИз, ВиртуальнаяТаблица);
						Если ТекстИзССоединениями <> Неопределено Тогда
							ТекстИз = ТекстИзССоединениями;
						КонецЕсли;
					КонецПопытки;
					
				КонецЦикла;
				
				// функция которая добавляет СОЕДИНЕНИЕ в случае необходимости
				
				
				Для каждого Элемент из Параметр Цикл
					
					// формируется текст "    Справочник.Контрагенты.ИНН = &Параметр1" 
					
					// ИЗМЕНИТЬ ЛОГИКУ. ИСПОЛЬЗОВАНИЕ ПОПЫТКА ПЛОХАЯ ПРАКТИКА
					Попытка
						СтроковыйТипЗначения = Строка(Тип(Элемент.Значение));
						СтрокаМассив = СтрРазделить(ПолноеИмя, "."); 
						Имя = СтрокаМассив.Получить(СтрокаМассив.Количество() - 1);
						Если СтрокаМассив.Количество() > 3 Тогда
							Если Параметр = Параметры[КоличествоПараметров - 1] Тогда
								ТекстКГде = "    " +  "ВиртуальнаяТаблица"+ "." + Имя + " МЕЖДУ " + "&" +   Соответствие.Получить(ИндексПараметра) + " И " + "&" + Соответствие.Получить(ИндексПараметра + 1) + Символы.ПС;
							Иначе
								ТекстКГде = "    " +  "ВиртуальнаяТаблица"+ "." + Имя + " МЕЖДУ " + "&" + Соответствие.Получить(ИндексПараметра) + " И " + "&" +  Соответствие.Получить(ИндексПараметра + 1) + " И" + Символы.ПС;
							КонецЕсли;
							ТекстГде = ТекстГде + ТекстКГде;
							ИндексПараметра = ИндексПараметра + 2	
						Иначе
							Если Параметр = Параметры[КоличествоПараметров - 1] Тогда
								ТекстКГде = "    " +  Главная+ "." + Имя + " МЕЖДУ " + "&" +   Соответствие.Получить(ИндексПараметра) + " И " + "&" + Соответствие.Получить(ИндексПараметра + 1) + Символы.ПС;
							Иначе
								ТекстКГде = "    " +  Главная+ "." + Имя + " МЕЖДУ " + "&" + Соответствие.Получить(ИндексПараметра) + " И " + "&" +  Соответствие.Получить(ИндексПараметра + 1) + " И" + Символы.ПС;
							КонецЕсли;
							ТекстГде = ТекстГде + ТекстКГде;
							ИндексПараметра = ИндексПараметра + 2	
						КонецЕсли;
						
						
					Исключение
							СтрокаМассив = СтрРазделить(ПолноеИмя, "."); 
							Имя = СтрокаМассив.Получить(СтрокаМассив.Количество() - 1);
							Вид = ОпределитьПринадлежностьКВиду(Имя, ОбъектМетаданных);
							Если СтрокаМассив.Количество() > 3 Тогда 
								Если Параметр = Параметры[КоличествоПараметров - 1] Тогда
									ТекстКГде = "    " + "ВиртуальнаяТаблица"+ "." + Имя + " = " + "&" + Соответствие.Получить(ИндексПараметра) + Символы.ПС;
								Иначе
									ТекстКГде = "    " + "ВиртуальнаяТаблица"+ "." + Имя + " = " + "&" + Соответствие.Получить(ИндексПараметра) + " И" + Символы.ПС;
								КонецЕсли;
								ТекстГде = ТекстГде + ТекстКГде;
								ИндексПараметра = ИндексПараметра + 1;	
							Иначе
								Если Параметр = Параметры[КоличествоПараметров - 1] Тогда
									ТекстКГде = "    " + Главная+ "." + Имя + " = " + "&" + Соответствие.Получить(ИндексПараметра) + Символы.ПС;
								Иначе
									ТекстКГде = "    " + Главная+ "." + Имя + " = " + "&" + Соответствие.Получить(ИндексПараметра) + " И" + Символы.ПС;
								КонецЕсли;
								ТекстГде = ТекстГде + ТекстКГде;
								ИндексПараметра = ИндексПараметра + 1;	
							КонецЕсли
                              					
							
						
						КонецПопытки;
					КонецЦикла;
						
					
						
																						
						
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	СтрокиГдеИз = Новый Массив;
	СтрокиГдеИз.Добавить(ТекстГде);
	СтрокиГдеИз.Добавить(ТекстИз);
	СтрокиГдеИз.Добавить(Запрос);
	
	Возврат СтрокиГдеИз;
КонецФункции

&НаСервере
Функция СоединениеВТекстеИз(Параметр, ОбъектМетаданных, ТекстИз,  ВиртуальнаяТаблица = "")
	// соединения нужны, если берутся данные из разных таблиц
	// эта функция проверяет является ли тип параметра другой таблицей, отличной от существующей (ОбъектМетаданных)
	// если да, то формируется текст с соединением (выбрано Левое, как универсальное)
	
	Для каждого Элемент из Параметр Цикл
		
			
			Если Строка(ТипЗнч(Элемент.Значение)) <> "Дата" И Строка(ТипЗнч(Элемент.Значение)) <> "Строка" И Строка(ТипЗнч(Элемент.Значение)) <> "Число" И Строка(ТипЗнч(Элемент.Значение)) <> "Булево" Тогда  
				ПроверкаНаТип = Метаданные.НайтиПоТипу(ТипЗнч(Элемент.Значение)).ПолноеИмя();
				Если СтрНайти(Метаданные.НайтиПоТипу(ТипЗнч(Элемент.Значение)).ПолноеИмя(), "Перечисление") <> 0 Тогда
					Возврат ТекстИз;
				Иначе
					Если ПроверкаНаТип <> ОбъектМетаданных Тогда
						Если НЕ ЗначениеЗаполнено(ВиртуальнаяТаблица) Тогда
							ТипСсылка = ПроверкаНаТип + ".Ссылка";
							ТекстИз = ТекстИз + "    "  + " ЛЕВОЕ СОЕДИНЕНИЕ " + ПроверкаНаТип + Символы.ПС + "    ПО " + Элемент.Ключ + " = " + ТипСсылка + Символы.ПС;
							Возврат ТекстИз;
						Иначе
							СтрокаМассив = СтрРазделить(Элемент.Ключ, ".");
							ПоследнийЭлемент = СтрокаМассив.Получить(СтрокаМассив.Количество() - 1);
							ТекстИз = ТекстИз + "        И " + "ВиртуальнаяТаблица" + "." + ПоследнийЭлемент + " = " + "ГлавнаяТаблица" + "." + ПоследнийЭлемент + Символы.ПС;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		
	КонецЦикла;
КонецФункции

&НаСервере
Функция СтрокаСгруппироватьПо(Группировки, Главная, Виртуальная, ОбъектМетаданных)
	Если Главная = Неопределено ИЛИ Виртуальная = Неопределено Тогда
		Главная = ОбъектМетаданных;
	КонецЕсли;
	Если Группировки <> Неопределено Тогда
		ТестСгруппироватьПо = "";
		КоличествоГруппировок = Группировки.Количество();

		Если КоличествоГруппировок > 0 Тогда
			ТекстСгруппироватьПо = "СГРУППИРОВАТЬ ПО" + Символы.ПС;
			Для каждого Группировка из Группировки Цикл
				СтрокаМассив = СтрРазделить(Группировка, "."); 
				Имя = СтрокаМассив.Получить(СтрокаМассив.Количество() - 1);
				Если СтрокаМассив.Количество() > 3 Тогда
					Если Группировка = Группировки[КоличествоГруппировок - 1] Тогда 
						 Группировка = "    " +  "ВиртуальнаяТаблица" + "." + Имя + Символы.ПС;
					Иначе
						 Группировка = "    " +  "ВиртуальнаяТаблица" + "." + Имя + "," + Символы.ПС;
					КонецЕсли;
					ТекстСгруппироватьПо  = ТекстСгруппироватьПо  + Группировка; 
				Иначе
					
					Если Группировка = Группировки[КоличествоГруппировок - 1] Тогда 
						 Группировка = "    " +  Главная + "." + Имя + Символы.ПС;
					Иначе
						 Группировка = "    " +  Главная + "." + Имя + "," + Символы.ПС;
					КонецЕсли;
					ТекстСгруппироватьПо  = ТекстСгруппироватьПо  + Группировка; 
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Возврат ТекстСгруппироватьПо;
КонецФункции

&НаСервере
Функция СтрокаИтоги(Итоги)
	ТекстИтоги = "";
	Если ЗначениеЗаполнено(Итоги) Тогда
	
		ТекстИтоги = "ИТОГИ" + Символы.ПС + "    " + Итоги + Символы.ПС;
	КонецЕсли;
	Возврат ТекстИтоги;
	
	
КонецФункции

&НаСервере
Функция СтрокаПо(ИтогиПо, Главная, Виртуальная, ОбъектМетаданных)
	Если Главная = Неопределено ИЛИ Виртуальная = Неопределено Тогда
		Главная = ОбъектМетаданных;
	КонецЕсли;
	ТекстПо = "";
	Если ИтогиПо <> Неопределено Тогда
		КоличествоИтогов = ИтогиПо.Количество(); 
		Если КоличествоИтогов <> 0 Тогда
			ТекстПо = "ПО" + Символы.ПС;
			Для каждого Элемент из ИтогиПо Цикл
				СтрокаМассив = СтрРазделить(Элемент, "."); 
				Имя = СтрокаМассив.Получить(СтрокаМассив.Количество() - 1);
				Если СтрокаМассив.Количество() > 3 Тогда
					Если Элемент = ИтогиПо[КоличествоИтогов - 1] Тогда 
						Элемент = "    " +  "ВиртуальнаяТаблица" + "." + Имя + Символы.ПС;
					Иначе
						Элемент = "    " +  "ВиртуальнаяТаблица" + "." + Имя + "," + Символы.ПС;
					КонецЕсли;
					ТекстПо  = ТекстПо  + Элемент;
				Иначе
					Если Элемент = ИтогиПо[КоличествоИтогов - 1] Тогда 
						Элемент = "    " +  Главная + "." + Имя + Символы.ПС;
					Иначе
						Элемент = "    " +  Главная + "." + Имя + "," + Символы.ПС;
					КонецЕсли;
					ТекстПо  = ТекстПо  + Элемент; 
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Возврат ТекстПо;
	
КонецФункции

&НаСервере
Функция СтрокаПорядок(МассивПорядок, Реквизиты, Главная, Виртуальная, ОбъектМетаданных)
	ТекстУпорядочитьПо = "";
	Если Главная = Неопределено ИЛИ Виртуальная = Неопределено Тогда
		Главная = ОбъектМетаданных;
	КонецЕсли;
	Если МассивПорядок <> Неопределено Тогда
		КоличествоПорядка = МассивПорядок.Количество();

		Если КоличествоПорядка > 0 Тогда
			ТекстУпорядочитьПо = "УПОРЯДОЧИТЬ ПО" + Символы.ПС;
			Для каждого Порядок из МассивПорядок Цикл
				
				Псевдоним = "";		
				СтрокаМассив = СтрРазделить(Порядок, "."); 
				ПорядокМассив = СтрРазделить(Порядок, " ");
				
				Имя = СтрокаМассив.Получить(СтрокаМассив.Количество() - 1);
				Для каждого Реквизит из Реквизиты Цикл
					
					Если СтрНайти(Реквизит, ПорядокМассив[0]) <> 0 Тогда
						ЕстьЛиПсевдоним = СтрРазделить(Реквизит, " ");
						Если ЕстьЛиПсевдоним.Количество() > 1 Тогда
							
							Псевдоним = ЕстьЛиПсевдоним[2];
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если НЕ ЗначениеЗаполнено(Псевдоним) Тогда
					Если СтрокаМассив.Количество() > 3 Тогда
							Если Порядок = МассивПорядок[КоличествоПорядка - 1] Тогда 
							Порядок = "    " +  "ВиртуальнаяТаблица" + "." + Имя + Символы.ПС;
						Иначе
							Порядок = "    " +  "ВиртуальнаяТаблица" + "." + Имя + "," + Символы.ПС;
						КонецЕсли;
						ТекстУпорядочитьПо  = ТекстУпорядочитьПо  + Порядок;	
					Иначе
						
						Если Порядок = МассивПорядок[КоличествоПорядка - 1] Тогда 
							Порядок = "    " +  Главная + "." + Имя + Символы.ПС;
						Иначе
							Порядок = "    " +  Главная + "." + Имя + "," + Символы.ПС;
						КонецЕсли;
						ТекстУпорядочитьПо  = ТекстУпорядочитьПо  + Порядок;
					КонецЕсли; 
				Иначе
					Если СтрокаМассив.Количество() > 3 Тогда
							Если Порядок = МассивПорядок[КоличествоПорядка - 1] Тогда 
							Порядок = "    " +  Псевдоним + Символы.ПС;
						Иначе
							Порядок = "    " +  Псевдоним + "," + Символы.ПС;
						КонецЕсли;
						ТекстУпорядочитьПо  = ТекстУпорядочитьПо  + Порядок;	
					Иначе
						
						Если Порядок = МассивПорядок[КоличествоПорядка - 1] Тогда 
							Порядок = "    " +  Псевдоним  + Символы.ПС;
						Иначе
							Порядок = "    " +  Псевдоним  + "," + Символы.ПС;
						КонецЕсли;
						ТекстУпорядочитьПо  = ТекстУпорядочитьПо  + Порядок;
					КонецЕсли;
				КонецЕсли;
					
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Возврат ТекстУпорядочитьПо;

КонецФункции

#КонецОбласти 

#Область ВспомогательныеФункции

&НаСервере
Функция НайтиТипПараметра(Название, ОбъектМетаданных, Вид) Экспорт
	Если Название = "Ссылка" Тогда
		СтрокаСсылка = СтрЗаменить(ОбъектМетаданных, ".", "Ссылка.");
		
		
		// Справочник.Банки вставить Ссылка и будет СправочникСсылка.Банки
		ТипПараметра = Тип(СтрокаСсылка);
 
	Иначе
		Если Вид = "Ресурс" Тогда
			ТипПараметра = Метаданные.НайтиПоПолномуИмени(ОбъектМетаданных).Ресурсы.Найти(Название).Тип;
		ИначеЕсли Вид = "Измерение" Тогда
			ТипПараметра = Метаданные.НайтиПоПолномуИмени(ОбъектМетаданных).Измерения.Найти(Название).Тип;
		ИначеЕсли Вид = "Реквизит" Тогда
			ТипПараметра = Метаданные.НайтиПоПолномуИмени(ОбъектМетаданных).Реквизиты.Найти(Название).Тип;
		КонецЕсли;
	КонецЕсли;
	Возврат ТипПараметра;
КонецФункции

&НаСервере
Функция ОпределитьПринадлежностьКВиду(Название, ОбъектМетаданных) Экспорт
	ЭтоРеквизит = Метаданные.НайтиПоПолномуИмени(ОбъектМетаданных).Реквизиты.Найти(Название);
	Если ЭтоРеквизит <> Неопределено Тогда
		Возврат "Реквизит";
	КонецЕсли;
	
	ЭтоИзмерение = Метаданные.НайтиПоПолномуИмени(ОбъектМетаданных).Измерения.Найти(Название);
	Если ЭтоИзмерение <> Неопределено Тогда
		Возврат "Измерение";
	КонецЕсли;
	
	ЭтоРесурс = Метаданные.НайтиПоПолномуИмени(ОбъектМетаданных).Ресурсы.Найти(Название);
	Если ЭтоИзмерение <> Неопределено Тогда
		Возврат "Ресурс";
	КонецЕсли;
КонецФункции

&НаСервере
Функция ОшибкаДляПользователя(Ошибка)
	Если СтрНайти(Ошибка, "Поле не входит в группу") <> 0 Тогда
		ПозицияНачалаОписанияОшибки = СтрНайти(Ошибка, "Поле не входит в группу");
		Ошибка = Сред(Ошибка, ПозицияНачалаОписанияОшибки);
		ПозицияКонцаОписанияОшибки = СтрНайти(Ошибка, "<<?>>");
		Ошибка = Лев(Ошибка, ПозицияКонцаОписанияОшибки - 1);
		Ошибка = Ошибка + Символы.ПС + "Добавьте реквизит в СГРУППИРОВАТЬ ПО путём отметки [Добавить в группировку]";
		Возврат Ошибка;
	КонецЕсли
КонецФункции
	
#КонецОбласти 