//@skip-check module-structure-form-event-regions
//@skip-check module-structure-top-region
//@skip-check invocation-form-event-handler
//@skip-check  bsl-legacy-check-string-literal
//@skip-check method-too-many-params
//@skip-check use-non-recommended-method


#Область ПриОткрытииФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	Элементы.ПолеТипМетаданных.СписокВыбора.Добавить("Справочник");
	Элементы.ПолеТипМетаданных.СписокВыбора.Добавить("Документ");
	Элементы.ПолеТипМетаданных.СписокВыбора.Добавить("Перечисление");
	Элементы.ПолеТипМетаданных.СписокВыбора.Добавить("План видов характеристик");
	Элементы.ПолеТипМетаданных.СписокВыбора.Добавить("Регистр сведений");
	Элементы.ПолеТипМетаданных.СписокВыбора.Добавить("Регистр накопления");
	
	Элементы.ПолеВидПорядка.СписокВыбора.Добавить("ВОЗР");
	Элементы.ПолеВидПорядка.СписокВыбора.Добавить("УБЫВ");
КонецПроцедуры

	
#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипМетаданныхПриИзменении(Элемент)
	Элементы.ПолеОбъектМетаданных.СписокВыбора.Очистить();
	Элементы.ПолеВиртуальнаяТаблица.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(ТипМетаданных) Тогда
		Элементы.ПолеОбъектМетаданных.Доступность = Истина; 
	Иначе
		Элементы.ПолеОбъектМетаданных.Доступность = Ложь;
	КонецЕсли;
	
	ЗаполнитьПолеОбъекта();
	ОбъектМетаданных = "";	
	ПолеОбъектМетаданныхПриИзменении(Элементы.ПолеОбъектМетаданных);

КонецПроцедуры

&НаКлиенте
Процедура ПолеТипМетаданныхОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПолеТипМетаданныхОбработкаВыбора(Элемент, "", СтандартнаяОбработка);	 
КонецПроцедуры 

&НаКлиенте
Процедура ПолеОбъектМетаданныхПриИзменении(Элемент)
	ВидДанных.Очистить();
	Элементы.ПолеРеквизит.СписокВыбора.Очистить();
	Элементы.ПолеПараметрЗапроса.СписокВыбора.Очистить();
	Элементы.ПолеРесурс.СписокВыбора.Очистить();
	Элементы.ПолеИзмерение.СписокВыбора.Очистить();
	Элементы.ПолеИтоги.СписокВыбора.Очистить();
	Элементы.ПолеУпорядочитьПо.СписокВыбора.Очистить();
	Элементы.ПолеВиртуальнаяТаблица.СписокВыбора.Очистить();
	Элементы.ПолеПо.СписокВыбора.Очистить();

	Элементы.ПолеИтоги.Доступность = Ложь;
	Элементы.ПолеВиртуальнаяТаблица.Доступность = Ложь;
	Элементы.ГруппаРесурсы.Видимость = Ложь;
	Элементы.ГруппаИзмерения.Видимость = Ложь;
		
	Если ЗначениеЗаполнено(ОбъектМетаданных) Тогда 
		Если ТипМетаданных <> "Перечисление" Тогда
			Если ТипМетаданных = "Регистр сведений" ИЛИ ТипМетаданных = "Регистр накопления" Тогда
				Элементы.ПолеВиртуальнаяТаблица.Доступность = Истина; 
				ЗаполнитьПолеВиртуальнойТаблицы();
				ЗаполнитьПоляДанных("Ресурсы", "ПолеРесурс", "Ресурс", "ГруппаРесурсы");
				ЗаполнитьПоляДанных("Измерения", "ПолеИзмерение", "Измерение", "ГруппаИзмерения");
				
			КонецЕсли;
			ЗаполнитьПоляДанных("Реквизиты", "ПолеРеквизит", "Реквизит", "ПолеРеквизит");
		КонецЕсли;	
	Иначе
		Элементы.ПолеРеквизит.Доступность = Ложь;
		Элементы.ПолеПараметрЗапроса.Доступность = Ложь;  
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВиртуальнаяТаблица) Тогда
		ВиртуальнаяТаблица = "";
		ВиртуальнаяТаблицаПриИзменении(Элементы.ПолеВиртуальнаяТаблица);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитОбъектаМетаданных) Тогда
		РеквизитОбъектаМетаданных = "";
		ПолеРеквизитОбъектаПриИзменении(Элементы.ПолеРеквизит);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РесурсОбъектаМетаданных) Тогда
		РесурсОбъектаМетаданных = "";
		РесурсОбъектаМетаданныхПриИзменении(Элементы.ПолеРесурс);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИзмерениеОбъектаМетаданных) Тогда
		ИзмерениеОбъектаМетаданных = "";
		ИзмерениеОбъектаМетаданныхПриИзменении(Элементы.ПолеИзмерение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрЗапроса) Тогда
		ПараметрЗапроса = "";
		ПолеПараметрОбъектаПриИзменении(Элементы.ПолеПараметрЗапроса);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Итоги) Тогда
		Итоги = "";
		ИтогиПриИзменении(Элементы.ПолеИтоги);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УпорядочитьПо) Тогда
		УпорядочитьПо = "";
		УпорядочитьПоПриИзменении(Элементы.ПолеУпорядочитьПо);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеОбъектМетаданныхОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПолеОбъектМетаданныхОбработкаВыбора(Элемент, "", СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ВиртуальнаяТаблицаПриИзменении(Элемент)
	Для Каждого Ресурс из Элементы.ПолеРесурс.СписокВыбора Цикл
		Параметр = Элементы.ПолеПараметрЗапроса.СписокВыбора.НайтиПоЗначению(Ресурс.Значение);
		Элементы.ПолеПараметрЗапроса.СписокВыбора.Удалить(Параметр);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПараметрЗапроса) Тогда
		ПараметрЗапроса = "";
		ПолеПараметрОбъектаПриИзменении(Элементы.ПолеПараметрЗапроса); 	
	КонецЕсли;
	
	
	Для Каждого Элемент из ВидДанных Цикл
		Если Элемент.Представление = "Ресурс" Тогда
			ВидДанных.Удалить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	РегистрНачало = "";
	РегистрКонец = "";
	
	Если ЗначениеЗаполнено(ИзмерениеОбъектаМетаданных) Тогда
		ИзмерениеОбъектаМетаданных = "";
		ИзмерениеОбъектаМетаданныхПриИзменении(Элементы.ПолеИзмерение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РесурсОбъектаМетаданных) Тогда
		РесурсОбъектаМетаданных = "";
		РесурсОбъектаМетаданныхПриИзменении(Элементы.ПолеРесурс);
	КонецЕсли;
	
	
	Элементы.ПолеРесурс.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(ОбъектМетаданных) Тогда
		РесурсыОбъекта = Реквизиты(ОбъектМетаданных, ТипМетаданных, "Ресурсы");	
		Если ЗначениеЗаполнено(ВиртуальнаяТаблица) Тогда
			Элементы.ГруппаДатаРегистра.Видимость = Истина;
			Для каждого Ресурс из РесурсыОбъекта Цикл
				ЗаполнитьРесурсыПоВиртуальнойТаблице(Ресурс);
			КонецЦикла;
		Иначе
			Для каждого Ресурс из РесурсыОбъекта Цикл
				Элементы.ПолеРесурс.СписокВыбора.Добавить(Ресурс.Значение);
				Элементы.ПолеПараметрЗапроса.СписокВыбора.Добавить(Ресурс.Значение);
				ВидДанных.Добавить(Ресурс.Значение, "Ресурс");	
				Элементы.ГруппаДатаРегистра.Видимость = Ложь;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ВиртуальнаяТаблицаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВиртуальнаяТаблицаОбработкаВыбора(Элемент, "", СтандартнаяОбработка);
КонецПроцедуры


&НаКлиенте
Процедура ПолеРеквизитОбъектаПриИзменении(Элемент)
	
	Элементы.ПолеВидАгрегацииРеквизита.СписокВыбора.Очистить();
	ВключитьВГруппировкуРеквизит = Ложь;
	
	Если ЗначениеЗаполнено(РеквизитОбъектаМетаданных) Тогда
		Элементы.ПолеПсевдонимРеквизита.Доступность = Истина;	
		Элементы.ПолеВидАгрегацииРеквизита.Доступность = Истина;
		Элементы.КнопкаДобавитьРеквизит.Доступность = Истина;
		Элементы.КнопкаУдалитьРеквизит.Доступность = Истина;
		Элементы.ФлажокВключитьВГруппировкуРеквизит.Доступность = Истина;
		
		ТипРеквизита = Строка(ТипРеквизита(РеквизитОбъектаМетаданных, "Реквизит"));
		ЗаполнитьПолеВидАгрегации("ПолеВидАгрегацииРеквизита", ТипРеквизита);
	Иначе
		Элементы.ПолеПсевдонимРеквизита.Доступность = Ложь;
		Элементы.ПолеВидАгрегацииРеквизита.Доступность = Ложь;
		Элементы.КнопкаДобавитьРеквизит.Доступность = Ложь;
		Элементы.КнопкаУдалитьРеквизит.Доступность = Ложь;
		Элементы.ФлажокВключитьВГруппировкуРеквизит.Доступность = Ложь;
	КонецЕсли;
	ПсевдонимРеквизита = "";
	ВидАгрегацииРеквизита = "";
	
		
КонецПроцедуры

&НаКлиенте
Процедура РесурсОбъектаМетаданныхПриИзменении(Элемент)
	Элементы.ПолеВидАгрегацииРесурса.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(РесурсОбъектаМетаданных) Тогда
		Элементы.ПолеПсевдонимРесурса.Доступность = Истина;	
		Элементы.ПолеВидАгрегацииРесурса.Доступность = Истина;
		Элементы.КнопкаДобавитьРесурс.Доступность = Истина;
		Элементы.КнопкаУдалитьРесурс.Доступность = Истина;
		Если ЗначениеЗаполнено(ВиртуальнаяТаблица) Тогда
			Ресурс = РесурсБезСуффикса(РесурсОбъектаМетаданных, ВиртуальнаяТаблица);
			ТипРеквизита = Строка(ТипРеквизита(Ресурс, "Ресурс"));
		Иначе
			ТипРеквизита = Строка(ТипРеквизита(РесурсОбъектаМетаданных, "Ресурс"));
		КонецЕсли;
		ЗаполнитьПолеВидАгрегации("ПолеВидАгрегацииРесурса", ТипРеквизита);
		
	Иначе
		Элементы.ПолеПсевдонимРесурса.Доступность = Ложь;
		Элементы.ПолеВидАгрегацииРесурса.Доступность = Ложь;
		Элементы.КнопкаДобавитьРесурс.Доступность = Ложь;
		Элементы.КнопкаУдалитьРесурс.Доступность = Ложь;
	КонецЕсли;
	ПсевдонимРесурса = "";
	ПолеВидАгрегацииРесурса = "";

КонецПроцедуры

&НаКлиенте
Процедура ИзмерениеОбъектаМетаданныхПриИзменении(Элемент)
	Элементы.ПолеВидАгрегацииИзмерения.СписокВыбора.Очистить();
	ВключитьВГруппировкуИзмерение = Ложь;
	
	Если ЗначениеЗаполнено(ИзмерениеОбъектаМетаданных) Тогда
		Элементы.ПолеПсевдонимИзмерения.Доступность = Истина;	
		Элементы.ПолеВидАгрегацииИзмерения.Доступность = Истина;
		Элементы.КнопкаДобавитьИзмерение.Доступность = Истина;
		Элементы.КнопкаУдалитьИзмерение.Доступность = Истина;
		Элементы.ФлажокВключитьВГруппировкуИзмерение.Доступность = Истина;
		
		ТипРеквизита = Строка(ТипРеквизита(ИзмерениеОбъектаМетаданных, "Измерение"));
		ЗаполнитьПолеВидАгрегации("ПолеВидАгрегацииИзмерения", ТипРеквизита);
	Иначе
		Элементы.ПолеПсевдонимИзмерения.Доступность = Ложь;
		Элементы.ПолеВидАгрегацииИзмерения.Доступность = Ложь;
		Элементы.КнопкаДобавитьИзмерение.Доступность = Ложь;
		Элементы.КнопкаУдалитьИзмерение.Доступность = Ложь;
		Элементы.ФлажокВключитьВГруппировкуРеквизит.Доступность = Ложь;
	КонецЕсли;
	ПсевдонимИзмерения = "";
	ПолеВидАгрегацииИзмерения = "";
КонецПроцедуры

&НаКлиенте
Процедура ПолеПараметрОбъектаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ПараметрЗапроса) Тогда
		Элементы.КнопкаУдалитьПараметр.Доступность = Истина;
		Если ДобавитьМежду Тогда
			УдалитьПоляДляМежду();
			ДобавитьМежду = Ложь;
			ДобавитьМеждуПриИзменении(Элементы.ФлажокДобавитьМежду);
		Иначе
			УдалитьПолеИРеквизитЗначениеПараметра();
			ДобавитьПолеИРеквизитЗначениеПараметра();
		КонецЕсли;
	Иначе
		УдалитьПоляДляМежду();
		УдалитьПолеИРеквизитЗначениеПараметра();
		Элементы.ФлажокДобавитьМежду.Доступность = Ложь;
		ДобавитьМежду = Ложь;
		Элементы.КнопкаУдалитьПараметр.Доступность = Ложь;
		
	КонецЕсли;
	Элементы.КнопкаДобавитьПараметр.Доступность = Ложь;
		
КонецПроцедуры

&НаКлиенте
Процедура ПолеЗначениеПараметраПриИзменении(Элемент)
	Если ОтключитьКнопку Тогда
		Элементы.КнопкаДобавитьПараметр.Доступность = Ложь;
	Иначе
		ВсеРеквизитыЗаполнены = Истина;
		ЭлементыГруппы = Элементы.Найти("ГруппаВводЗначенияПараметра").ПодчиненныеЭлементы;
		Если ЭлементыГруппы.Количество() > 0 Тогда
			Для каждого ЭлементГруппы из ЭлементыГруппы цикл
				Если НЕ ЗначениеЗаполнено(ЭлементГруппы.ТекстРедактирования) Тогда
					ВсеРеквизитыЗаполнены =  Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		Если ВсеРеквизитыЗаполнены Тогда
			Элементы.КнопкаДобавитьПараметр.Доступность = Истина;
		Иначе
			Элементы.КнопкаДобавитьПараметр.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	ОтключитьКнопку = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПолеЗначениеПараметраОчистка(Элемент);
	ОтключитьКнопку = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМеждуПриИзменении(Элемент)
		
	Элементы.КнопкаДобавитьПараметр.Доступность = Ложь;
	Если ДобавитьМежду Тогда
		УдалитьПолеИРеквизитЗначениеПараметра();
		ДобавитьПоляДляМежду(ПримитивныйТипПараметра);
	Иначе
		УдалитьПоляДляМежду();
		ДобавитьПолеИРеквизитЗначениеПараметра();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидПорядкаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ВидПорядка) Тогда
		Элементы.КнопкаДобавитьПорядок.Доступность = Истина;
	Иначе
		Элементы.КнопкаДобавитьПорядок.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеМеждуПриИзменении(Элемент)
	ПервыйРеквизит = ЗначениеРеквизитаПоНазванию("ПервыйМежду");
	ВторойРеквизит = ЗначениеРеквизитаПоНазванию("ВторойМежду");

	Если ЗначениеЗаполнено(ПервыйРеквизит) И ЗначениеЗаполнено(ВторойРеквизит) Тогда
		Элементы.КнопкаДобавитьПараметр.Доступность = Истина;
	Иначе
		Элементы.КнопкаДобавитьПараметр.Доступность = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УпорядочитьПоПриИзменении(Элемент)
	Если ЗначениеЗаполнено(УпорядочитьПо) Тогда
		Элементы.ПолеВидПорядка.Доступность = Истина;
		Элементы.КнопкаУдалитьПорядок.Доступность = Истина;
	Иначе
		Элементы.ПолеВидПорядка.Доступность = Ложь;
		Элементы.КнопкаУдалитьПорядок.Доступность = Ложь;
		ВидПорядка = "";

	КонецЕсли;
	ВидПорядкаПриИзменении(Элементы.ПолеВидПорядка);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИтогиПриИзменении(Элемент)

	УдалитьДекорациюИтоги();
	
	Если ЗначениеЗаполнено(Итоги) Тогда
		ДобавитьДекорациюИтоги();
		Элементы.ПолеПо.Доступность = Истина;
	Иначе
		Элементы.ПолеПо.Доступность = Ложь;
	КонецЕсли;
	ИтогиПо = "";
	ПоПриИзменении(Элементы.ПолеПо);	
КонецПроцедуры

&НаКлиенте
Процедура ПоПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ИтогиПо) Тогда
		Элементы.КнопкаДобавитьИтогиПо.Доступность = Истина;
		Элементы.КнопкаУдалитьИтогиПо.Доступность = Истина;
	Иначе
		Элементы.КнопкаДобавитьИтогиПо.Доступность = Ложь;
		Элементы.КнопкаУдалитьИтогиПо.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолеАгрегацияПриИзменении(Элемент)

	Если ЗначениеЗаполнено(ВидАгрегацииРеквизита) Тогда
		Элементы.ФлажокВключитьВГруппировкуРеквизит.Доступность = Ложь;
		ВключитьВГруппировкуРеквизит = Ложь;
	Иначе
		Элементы.ФлажокВключитьВГруппировкуРеквизит.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолеВидАгрегацииИзмеренияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ПолеВидАгрегацииИзмерения) Тогда
		Элементы.ФлажокВключитьВГруппировкуИзмерение.Доступность = Ложь;
		ВключитьВГруппировкуИзмерение = Ложь;
	Иначе
		Элементы.ФлажокВключитьВГруппировкуИзмерение.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИспГруппировкуПриИзменении(Элемент)
	Если ВключитьВГруппировкуРеквизит Тогда
		Элементы.ПолеВидАгрегацииРеквизита.Доступность = Ложь;
		ВидАгрегацииРеквизита = "";
	Иначе
		Элементы.ПолеВидАгрегацииРеквизита.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ВключитьВГруппировкуИзмерениеПриИзменении(Элемент)
	Если ВключитьВГруппировкуИзмерение Тогда
		Элементы.ПолеВидАгрегацииИзмерения.Доступность = Ложь;
		ПолеВидАгрегацииИзмерения = "";
	Иначе
		Элементы.ПолеВидАгрегацииИзмерения.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область УдалениеДанных

&НаСервере
Процедура УдалитьДекорациюИтоги()
	
	ЭлементыГруппы = Элементы.ГруппаИтоги.ПодчиненныеЭлементы;	
	Если ЭлементыГруппы <> Неопределено Тогда
		Для каждого Элемент из ЭлементыГруппы Цикл
			Если Элемент.Заголовок <> Итоги Тогда
				Элементы.Удалить(Элемент);
				УдалитьВсеДекорацииПо();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УдалитьДекорациюПо()
	
	
	Элемент = Элементы.Найти("По"+ИтогиПо);
	Если Элемент <> Неопределено Тогда
		Элементы.Удалить(Элемент);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПоляДляМежду()
	
	ЭлементыГруппы = Элементы.ГруппаПоляМежду.ПодчиненныеЭлементы;
	РеквизитыЭлементовГруппы = Новый Массив;
	
	Если ЭлементыГруппы.Количество() > 0 Тогда
		Индекс = ЭлементыГруппы.Количество() - 1; 
		Пока Индекс >= 0 Цикл
			Если ЭлементыГруппы[Индекс].Заголовок <> "И" Тогда 
				РеквизитыЭлементовГруппы.Добавить(ЭлементыГруппы[Индекс].ПутьКДанным);
			КонецЕсли;
			Элементы.Удалить(ЭлементыГруппы[Индекс]);
			Индекс = Индекс - 1;
			
		КонецЦикла;
	    	ИзменитьРеквизиты(, РеквизитыЭлементовГруппы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДекорациюУпорядочитьПо(Имя)
	
	
	Элемент = Элементы.Найти(Имя);
	Если Элемент <> Неопределено Тогда
		Элементы.Удалить(Элемент);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВсеДекорацииПо()
	Группа = Элементы.ГруппаПо.ПодчиненныеЭлементы;
	КоличествоЭлементов = Элементы.ГруппаПо.ПодчиненныеЭлементы.Количество();
	Индекс = КоличествоЭлементов - 1;
	
	Пока Индекс >= 0 Цикл
		Элементы.Удалить(Группа[Индекс]);
		Индекс = Индекс - 1;
	КонецЦикла 
	
КонецПроцедуры


&НаСервере
Процедура УдалитьПолеИРеквизитЗначениеПараметра()
	ЭлементыГруппы = Элементы.Найти("ГруппаВводЗначенияПараметра").ПодчиненныеЭлементы;
	РеквизитыЭлементовГруппы = Новый Массив;
		
	
	
	Если ЭлементыГруппы.Количество() > 0 Тогда
		Для каждого ЭлементГруппы из ЭлементыГруппы Цикл
			РеквизитыЭлементовГруппы.Добавить(ЭлементГруппы.ПутьКДанным);
			Элементы.Удалить(ЭлементГруппы);
			
		КонецЦикла;
	
		ИзменитьРеквизиты(, РеквизитыЭлементовГруппы);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УдалитьИзИтогов(Итоги, ИмяДекорации)
	
	Элемент = Элементы.ПолеИтоги.СписокВыбора.НайтиПоЗначению(Итоги);
	Элементы.ПолеИтоги.СписокВыбора.Удалить(Элемент);
	Итоги = "";
	УдалитьДекорациюИтоги();
	
		
	
КонецПроцедуры

&НаСервере
Процедура УдалитьИзПо(РеквизитОбъектаМетаданных)
	Попытка
		Элемент = Элементы.ПолеПо.СписокВыбора.НайтиПоЗначению(РеквизитОбъектаМетаданных);
		ДекорацииПо = Элементы.ГруппаПо.ПодчиненныеЭлементы;
		Для каждого Декорация из ДекорацииПо Цикл
			Если Декорация.Заголовок = Элемент Тогда
				УдалитьДекорациюПо(); 
			КонецЕсли;
		КонецЦикла;
		ЭлементПоЗначению = Элементы.ПолеПо.СписокВыбора.НайтиПоЗначению(РеквизитОбъектаМетаданных);
		Элементы.ПолеПо.СписокВыбора.Удалить(ЭлементПоЗначению);
		Если Элементы.ПолеПо.СписокВыбора.Количество() = 0 Тогда
			Элементы.ПолеПо.Доступность = Ложь;
			ИтогиПо = "";
		КонецЕсли;
	Исключение
		Возврат;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура УдалитьРеквизит(Имя) 	
	Элемент = Элементы.Найти(Имя);
	
	ЭлементИтог = Элементы.Найти("Итоги"+Имя);
	Если ЭлементИтог <> Неопределено Тогда
		УдалитьИзИтогов(Итоги, ЭлементИтог.Имя);
		УдалитьВсеДекорацииПо();
	КонецЕсли;
	
	
	УдалитьИзУпорядочитьПо(Элемент.Имя);
	УдалитьДекорациюУпорядочитьПо("Упорядочить"+Элемент.Имя);
	
		
	ГрЭлемент = Элементы.Найти("Гр"+Имя);
	
	УдалитьИзПо(Элемент.Заголовок);
	

	Элементы.Удалить(Элемент);
	Если ГрЭлемент <> Неопределено Тогда
		Элементы.Удалить(ГрЭлемент);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьИзУпорядочитьПо(Имя)
	Значение = Элементы.ПолеУпорядочитьПо.СписокВыбора.НайтиПоЗначению(Имя);
	Если Значение <> Неопределено Тогда
		Элементы.ПолеУпорядочитьПо.СписокВыбора.Удалить(Значение);
	КонецЕсли;
	
	Если Имя = УпорядочитьПо Тогда
		УпорядочитьПо = "";
		ВидПорядка = "";
		Элементы.ПолеВидПорядка.Доступность = Ложь;
		Элементы.КнопкаДобавитьПорядок.Доступность = Ложь;
		Элементы.КнопкаУдалитьПорядок.Доступность = Ложь;
	КонецЕсли;
	
	
	Если Элементы.ПолеУпорядочитьПо.СписокВыбора.Количество() = 0 Тогда
		Элементы.ПолеУпорядочитьПо.Доступность = Ложь;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПараметр(Имя)
	Если СтрНайти(Имя, "Надпись") <> 0 Тогда
		Надпись = Элементы.Найти(Имя);
		Элементы.Удалить(Надпись);
		Для каждого Параметр из ЗначенияПараметров цикл                                   
			Если Параметр.Представление = ПараметрЗапроса Тогда
				ЗначенияПараметров.Удалить(Параметр);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Надпись = Элементы.Найти(Имя);
		Элементы.Удалить(Надпись);
		Для каждого Параметр из ЗначенияПараметров Цикл
			Если Строка(Тип(Параметр.Значение)) = "Массив" Тогда
				ЗначенияПараметров.Удалить(Параметр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти 

#Область ОбработчикиКоманд

&НаКлиенте
Процедура КомДобавитьПорядок(Команда)
	Если Элементы.Найти("Упорядочить" + УпорядочитьПо) <> Неопределено Тогда
			ПоказатьПредупреждение(, "По данному реквизиту уже есть порядок", 10, "Порядок записей");
		Иначе
			Тип = ТипДанныхРеквизита(УпорядочитьПо, ОбъектМетаданных, ВиртуальнаяТаблица);
			ДобавитьДекорациюУпорядочить(Тип);
		КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомУдалитьПорядок(Команда)
	Если Элементы.Найти("Упорядочить" + УпорядочитьПо) <> Неопределено Тогда
			УдалитьДекорациюУпорядочитьПо("Упорядочить" + УпорядочитьПо);
		Иначе
			ПоказатьПредупреждение(, "Данный реквизит уже удален из порядка!", 10);
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомДобавитьРесурс(Команда)
	Если Элементы.Найти(РесурсОбъектаМетаданных) <> Неопределено Тогда
			ПоказатьПредупреждение(, "Данный ресурс уже добавлен!", 10, "Добавление ресурса");
		Иначе
			Если ЗначениеЗаполнено(ПсевдонимРесурса) ТОГДА
				ДобавитьРеквизит(Истина, РесурсОбъектаМетаданных, ПолеВидАгрегацииРесурса, Ложь, ПсевдонимРесурса, Ложь);
			Иначе
				Если ЗначениеЗаполнено(ПолеВидАгрегацииРесурса) Тогда
					ПоказатьПредупреждение(, "Не заполнен псевдоним агрегированного ресурса!", 10);
				Иначе
					ДобавитьРеквизит(Ложь, РесурсОбъектаМетаданных, ПолеВидАгрегацииРесурса, Ложь, ПсевдонимРесурса, Ложь);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомУдалитьРесурс(Команда)
	Если Элементы.Найти(РесурсОбъектаМетаданных) <> Неопределено Тогда
			УдалитьРеквизит(РесурсОбъектаМетаданных);
			УпорядочитьПоПриИзменении(Элементы.ПолеУпорядочитьПо);
		Иначе
			ПоказатьПредупреждение(, "Данный реквизит отсутствует в списке или уже удален!", 10);
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомДобавитьИзмерение(Команда)
	Если Элементы.Найти(ИзмерениеОбъектаМетаданных) <> Неопределено Тогда
			ПоказатьПредупреждение(, "Данное измерение уже добавлено!", 10, "Добавление измерения");
		Иначе
			Если ЗначениеЗаполнено(ПсевдонимИзмерения) ТОГДА
				ДобавитьРеквизит(Истина, ИзмерениеОбъектаМетаданных, ПолеВидАгрегацииИзмерения, ВключитьВГруппировкуИзмерение, ПсевдонимИзмерения, Ложь);
			Иначе
				Если ЗначениеЗаполнено(ПолеВидАгрегацииИзмерения) Тогда
					ПоказатьПредупреждение(, "Не заполнен псевдоним агрегированного измерения!", 10);
				Иначе
					ДобавитьРеквизит(Ложь, ИзмерениеОбъектаМетаданных, ПолеВидАгрегацииИзмерения, ВключитьВГруппировкуИзмерение, ПсевдонимИзмерения, Ложь);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомУдалитьИзмерение(Команда)
	Если Элементы.Найти(ИзмерениеОбъектаМетаданных) <> Неопределено Тогда
			УдалитьРеквизит(ИзмерениеОбъектаМетаданных);
			УпорядочитьПоПриИзменении(Элементы.ПолеУпорядочитьПо);
		Иначе
			ПоказатьПредупреждение(, "Данный реквизит отсутствует в списке или уже удален!", 10);
		КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура КомДобавитьИтогиПо(Команда)
	
		Если Элементы.Найти("По" + ИтогиПо) <> Неопределено Тогда
			ПоказатьПредупреждение(, "По данному реквизиту уже имеются итоги", 10, "Добавление итогов");
		Иначе 
			Тип = ТипДанныхРеквизита(ИтогиПо, ОбъектМетаданных, ВиртуальнаяТаблица);
			ДобавитьДекорациюПо(Тип);
		КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомУдалитьИтогиПо(Команда)
	Если Элементы.Найти("По" + ИтогиПо) <> Неопределено Тогда
			УдалитьДекорациюПо();
		Иначе
			ПоказатьПредупреждение(, "Данный реквизит уже удален для итогов!", 10);
		КонецЕсли;
КонецПроцедуры

                                                                                

&НаКлиенте
Процедура КомДобавитьРеквизит(Команда)
	
		Если Элементы.Найти(РеквизитОбъектаМетаданных) <> Неопределено Тогда
			ПоказатьПредупреждение(, "Данный реквизит уже добавлен!", 10, "Добавление реквизита");
		Иначе
			Если ЗначениеЗаполнено(ПсевдонимРеквизита) ТОГДА
				ДобавитьРеквизит(Истина, РеквизитОбъектаМетаданных, ВидАгрегацииРеквизита, ВключитьВГруппировкуРеквизит, ПсевдонимРеквизита);
			Иначе
				Если ЗначениеЗаполнено(ВидАгрегацииРеквизита) Тогда
					ПоказатьПредупреждение(, "Не заполнен псевдоним агрегированного реквизита!", 10);
				Иначе
					ДобавитьРеквизит(Ложь, РеквизитОбъектаМетаданных, ВидАгрегацииРеквизита, ВключитьВГруппировкуРеквизит, ПсевдонимРеквизита);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
Процедура КомУдалитьРеквизит(Команда)
	
		Если Элементы.Найти(РеквизитОбъектаМетаданных) <> Неопределено Тогда
			УдалитьРеквизит(РеквизитОбъектаМетаданных);
			УпорядочитьПоПриИзменении(Элементы.ПолеУпорядочитьПо);
		Иначе
			ПоказатьПредупреждение(, "Данный реквизит отсутствует в списке или уже удален!", 10);
		КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура КомУдалитьПараметр(Команда)
	Если Элементы.Найти("Надпись"+ПараметрЗапроса) = Неопределено И Элементы.Найти("НадписьСМежду"+ПараметрЗапроса) = Неопределено Тогда
		ПоказатьПредупреждение(, "Данный реквизит отсутствует в списке или уже удален!", 10);
		
				
	ИначеЕсли Элементы.Найти("Надпись"+ПараметрЗапроса) <> Неопределено Тогда 
		УдалитьПараметр("Надпись"+ПараметрЗапроса);
	Иначе
		УдалитьПараметр("НадписьСМежду"+ПараметрЗапроса);
	КонецЕсли;
КонецПроцедуры
	

&НаКлиенте
Процедура КомСформироватьОтчет(Команда)
	Если ТипМетаданных = "Перечисление" Тогда
		СформироватьОтчет();
	Иначе
		
		Если Элементы.ГруппаВыбрать.ПодчиненныеЭлементы.Количество() = 0 Тогда
			ПоказатьПредупреждение(, "Вы не выбрали реквизиты для показа в отчете");
		Иначе
			Если ЗначениеЗаполнено(ВиртуальнаяТаблица) Тогда
				Если НЕ ЗначениеЗаполнено(РегистрКонец) ИЛИ НЕ ЗначениеЗаполнено(РегистрНачало) Тогда
					ПоказатьПредупреждение(, "Необходимый параметр даты не указан для регистра");
				Иначе
					Если РегистрНачало > РегистрКонец Тогда
						ПоказатьПредупреждение(, "Дата начала не может быть больше даты конца");
					Иначе
						СформироватьОтчет();
					КонецЕсли;
	
				КонецЕсли;
			Иначе
				СформироватьОтчет();
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомДобавитьПараметр(Команда)
	Если Элементы.Найти("Надпись"+ПараметрЗапроса) <> Неопределено Тогда
			ПоказатьПредупреждение(, "Данный параметр уже добавлен!", 10, "Добавление параметра");
		Иначе
			Если ДобавитьМежду Тогда
				ДобавитьПараметр(Истина);
			Иначе
				ДобавитьПараметр(Ложь);
			КонецЕсли;
		КонецЕсли;

КонецПроцедуры 

#КонецОбласти 

#Область ДобавлениеЭлементовВФорму

&НаСервере
Процедура ДобавитьПолеИРеквизитЗначениеПараметра()
	Если ЗначениеЗаполнено(ПараметрЗапроса) Тогда
		Вид = ВидДанных.НайтиПоЗначению(ПараметрЗапроса);
		Если Вид <> Неопределено Тогда
			Представление = Вид.Представление;
		Иначе
			Представление = "";
		КонецЕсли;
		Параметр = РесурсБезСуффикса(ПараметрЗапроса, ВиртуальнаяТаблица);
		ТипПараметра = ТипРеквизита(Параметр, Представление);
		Если Строка(ТипПараметра) = "Строка" ИЛИ Строка(ТипПараметра) = "Число" ИЛИ Строка(ТипПараметра) = "Дата" Тогда
			Элементы.ФлажокДобавитьМежду.Доступность = Истина;
			ПримитивныйТипПараметра = Строка(ТипПараметра);
		Иначе
			Элементы.ФлажокДобавитьМежду.Доступность = Ложь;
		КонецЕсли;
		
		Реквизиты = Новый Массив;
	    ОписаниеТипа = Новый ОписаниеТипов(ТипПараметра);
	    НовыйРеквизит = Новый РеквизитФормы("Параметр"+ПараметрЗапроса, ОписаниеТипа);
	    Реквизиты.Добавить(НовыйРеквизит);
	    ИзменитьРеквизиты(Реквизиты);
	    
	    
	    Группа = Элементы.ГруппаВводЗначенияПараметра;
	    Поле = Элементы.Добавить("Поле"+ПараметрЗапроса, Тип("ПолеФормы"), Группа);
				
		Если  ТипПараметра = "Булево" Тогда
			Поле.Вид = ВидПоляФормы.ПолеФлажка;
		Иначе
			Поле.Вид = ВидПоляФормы.ПолеВвода;
			Поле.КнопкаОчистки = Истина;
		КонецЕсли;
		
	    Поле.ПутьКДанным = "Параметр"+ПараметрЗапроса; 
		Поле.Заголовок = ПараметрЗапроса; 
	    Поле.Ширина = 200;
		
		Поле.УстановитьДействие("ПриИзменении", "ПолеЗначениеПараметраПриИзменении");
		Поле.УстановитьДействие("Очистка", "ПолеЗначениеПараметраОчистка");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоляДляМежду(ПримитивныйТипПараметра)
	
		Реквизиты = Новый Массив;
	    ОписаниеТипа = Новый ОписаниеТипов(ПримитивныйТипПараметра);
	    ПервыйРеквизит = Новый РеквизитФормы("ПервыйМежду", ОписаниеТипа);
		ВторойРеквизит = Новый РеквизитФормы("ВторойМежду", ОписаниеТипа);
	    Реквизиты.Добавить(ПервыйРеквизит);
		Реквизиты.Добавить(ВторойРеквизит);

	    ИзменитьРеквизиты(Реквизиты);
	    Группа = Элементы.ГруппаПоляМежду;
	    ПолеПервое = Элементы.Добавить("ПолеПервоеМежду", Тип("ПолеФормы"), Группа);
		Декорация = Элементы.Добавить("ДекорацияМежду", Тип("ДекорацияФормы"), Группа);
		Декорация.Заголовок = "И";
		ПолеВторое = Элементы.Добавить("ПолеВтороеМежду", Тип("ПолеФормы"), Группа);
		
		
		ПолеПервое.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВторое.Вид = ВидПоляФормы.ПолеВвода;
		
	    ПолеПервое.ПутьКДанным = "ПервыйМежду";
		ПолеВторое.ПутьКДанным = "ВторойМежду";
		ПолеПервое.Заголовок = "Параметр 1";
		ПолеВторое.Заголовок = "Параметр 2";
	    ПолеПервое.Ширина = 100;
		ПолеВторое.Ширина = 100;
		
		ПолеПервое.КнопкаОчистки = Истина;
		ПолеВторое.КнопкаОчистки = Истина;
		
		ПолеПервое.УстановитьДействие("ПриИзменении", "ПолеМеждуПриИзменении");
		ПолеВторое.УстановитьДействие("ПриИзменении", "ПолеМеждуПриИзменении");
	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДекорациюИтоги()
	
	Группа = Элементы.ГруппаИтоги;
	
	Имя = СтрокаБезСкобок(Итоги);
	
	ИмяДекорации = "Итоги" + Имя;
	
	Надпись = Элементы.Добавить(ИмяДекорации, Тип("ДекорацияФормы"), Группа);
	Надпись.Заголовок = Итоги;
	Надпись.Ширина = 200; 
	Если ЗначениеЗаполнено(ВиртуальнаяТаблица) Тогда
			Надпись.Подсказка = ВиртуальнаяТаблица;
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДекорациюПо(Тип)
	
	Группа = Элементы.ГруппаПо;
	Имя = "По" + ИтогиПо;
	
	Надпись = Элементы.Добавить(Имя, Тип("ДекорацияФормы"), Группа);
	Надпись.Заголовок = ИтогиПо;
	Надпись.Ширина = 200;
	Если Тип <> "Реквизит" Тогда
		Если ЗначениеЗаполнено(ВиртуальнаяТаблица) Тогда
			Надпись.Подсказка = ВиртуальнаяТаблица;
		КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДекорациюУпорядочить(Тип)
	Группа = Элементы.ГруппаУпорядочитьПо;
	Имя = "Упорядочить" + УпорядочитьПо;
	
	Надпись = Элементы.Добавить(Имя, Тип("ДекорацияФормы"), Группа);
	Надпись.Заголовок = УпорядочитьПо + " " + ВидПорядка;
	Надпись.Ширина = 200;
	Если Тип <> "Реквизит" Тогда
		Если ЗначениеЗаполнено(ВиртуальнаяТаблица) Тогда
			Надпись.Подсказка = ВиртуальнаяТаблица;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизит(ЕстьПсевдоним, Имя, ВидАгрегацииРеквизита, ВключитьВГруппировку, Псевдоним = "", ЭтоРеквизит = Истина);
	
	Группа = Элементы.ГруппаВыбрать;
	Надпись = Элементы.Добавить(Имя, Тип("ДекорацияФормы"), Группа);
	Если НЕ ЭтоРеквизит Тогда
		Если ЗначениеЗаполнено(ВиртуальнаяТаблица) Тогда
			Надпись.Подсказка = ВиртуальнаяТаблица;
		КонецЕсли;
	КонецЕсли;
	Если ЕстьПсевдоним Тогда
		ДобавитьВУпорядочить(Имя);
		Если НЕ ЗначениеЗаполнено(ВидАгрегацииРеквизита) Тогда
			
			Надпись.Заголовок = Имя + " КАК " + Псевдоним;
							
			
			ДобавитьВПо(Имя);
			
			Если ВключитьВГруппировку Тогда
				ГрГруппировка = Элементы.ГруппаСгруппироватьПо;
				НадписьВГруппировку = Элементы.Добавить("Гр"+Имя, Тип("ДекорацияФормы"), ГрГруппировка);
				НадписьВГруппировку.Заголовок = Имя;
				НадписьВГруппировку.Ширина = 200;
				Если ЗначениеЗаполнено(ВиртуальнаяТаблица) И НЕ ЭтоРеквизит Тогда
					НадписьВГруппировку.Подсказка = ВиртуальнаяТаблица;
				КонецЕсли;


			КонецЕсли;

				
				
		Иначе
			Надпись.Заголовок = ВидАгрегацииРеквизита + "(" + Имя + ")" + " КАК " + Псевдоним;
			
			
			ДобавитьВИтоги(ВидАгрегацииРеквизита + "(" + Псевдоним + ")");
			
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(ВидАгрегацииРеквизита) Тогда
			Надпись.Заголовок = Имя;
			ДобавитьВПо(Имя);
			ДобавитьВУпорядочить(Имя);
			Если ВключитьВГруппировку Тогда
				ГрГруппировка = Элементы.ГруппаСгруппироватьПо;
				НадписьВГруппировку = Элементы.Добавить("Гр"+Имя, Тип("ДекорацияФормы"), ГрГруппировка);
				НадписьВГруппировку.Заголовок = Имя;
				НадписьВГруппировку.Ширина = 200;
				Если ЗначениеЗаполнено(ВиртуальнаяТаблица) И НЕ ЭтоРеквизит Тогда
					НадписьВГруппировку.Подсказка = ВиртуальнаяТаблица;
				КонецЕсли;

			КонецЕсли;	
		КонецЕсли;
		
	КонецЕсли;
	Надпись.Ширина = 200;
	
	
  
КонецПроцедуры

&НаСервере
Процедура ДобавитьВУпорядочить(Реквизит)
	СуществующийЭлемент = Элементы.ПолеУпорядочитьПо.СписокВыбора.НайтиПоЗначению(Реквизит);
	Если СуществующийЭлемент = Неопределено Тогда
		Элементы.ПолеУпорядочитьПо.СписокВыбора.Добавить(Реквизит);
		Элементы.ПолеУпорядочитьПо.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВПо(Реквизит)
	СуществующийЭлемент = Элементы.ПолеПо.СписокВыбора.НайтиПоЗначению(Реквизит);
	Если СуществующийЭлемент = Неопределено Тогда
		Элементы.ПолеПо.СписокВыбора.Добавить(Реквизит);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьВИтоги(АгрегированныйРеквизит)
	СуществующийЭлемент = Элементы.ПолеИтоги.СписокВыбора.НайтиПоЗначению(АгрегированныйРеквизит);
	Если СуществующийЭлемент = Неопределено Тогда
		Элементы.ПолеИтоги.СписокВыбора.Добавить(АгрегированныйРеквизит);
		Элементы.ПолеИтоги.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьПараметр(ЕстьМежду)
	Если НЕ ЕстьМежду Тогда
		Группа = Элементы.ГруппаГде;
		Надпись = Элементы.Добавить("Надпись"+ПараметрЗапроса, Тип("ДекорацияФормы"), Группа);
		Надпись.Заголовок = ПараметрЗапроса + " = " + ЭтотОбъект["Параметр"+ПараметрЗапроса];
		ЗначенияПараметров.Добавить(ЭтотОбъект["Параметр"+ПараметрЗапроса], ПараметрЗапроса);
		Надпись.Ширина = 200;
	Иначе
		Группа = Элементы.ГруппаГде;
		Надпись = Элементы.Добавить("НадписьСМежду"+ПараметрЗапроса, Тип("ДекорацияФормы"), Группа);
		Надпись.Заголовок = ПараметрЗапроса + " МЕЖДУ " + ЭтотОбъект["ПервыйМежду"] + " И " + ЭтотОбъект["ВторойМежду"];
		МассивДвухПараметров = Новый Массив;
		МассивДвухПараметров.Добавить(ЭтотОбъект["ПервыйМежду"]);
		МассивДвухПараметров.Добавить(ЭтотОбъект["ВторойМежду"]);
		ЗначенияПараметров.Добавить(МассивДвухПараметров, ПараметрЗапроса);
		Надпись.Ширина = 200;
	КонецЕсли
КонецПроцедуры


	
#КонецОбласти 

#Область ОбработчикиДиалоговогоОкна

&НаКлиенте
Процедура ПолеОбъектМетаданныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	КоличествоВыбрать = Элементы.ГруппаВыбрать.ПодчиненныеЭлементы.Количество();
	КоличествоГде = Элементы.ГруппаГде.ПодчиненныеЭлементы.Количество();
	
	Если ОбъектМетаданных <> ВыбранноеЗначение Тогда
		Если КоличествоВыбрать > 0 ИЛИ КоличествоГде > 0 Тогда
			Вопрос = "Вы действительно хотите изменить объект метаданных? Список реквизитов и параметров очистится!";
			ЗадатьВопрос(Вопрос, ВыбранноеЗначение, "Объект");
		Иначе
			ОбъектМетаданных = ВыбранноеЗначение;
			ПолеОбъектМетаданныхПриИзменении(Элемент);
		КонецЕсли;
	Иначе
		ОбъектМетаданных = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПолеТипМетаданныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	КоличествоВыбрать = Элементы.ГруппаВыбрать.ПодчиненныеЭлементы.Количество();
	КоличествоГде = Элементы.ГруппаГде.ПодчиненныеЭлементы.Количество();
	
	Если ТипМетаданных <> ВыбранноеЗначение Тогда
		Если КоличествоВыбрать > 0 ИЛИ КоличествоГде > 0 Тогда
			Вопрос = "Вы действительно хотите изменить тип метаданных? Список реквизитов и параметров очистится!";
			ЗадатьВопрос(Вопрос, ВыбранноеЗначение, "Тип");
		Иначе
			ТипМетаданных = ВыбранноеЗначение;
			ТипМетаданныхПриИзменении(Элемент);
		КонецЕсли;
	Иначе
		ТипМетаданных = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВиртуальнаяТаблицаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	КоличествоРеквизитов = Элементы.ГруппаВыбрать.ПодчиненныеЭлементы.Количество();
	КоличествоПараметров = Элементы.ГруппаГде.ПодчиненныеЭлементы.Количество();
	
	Если ВиртуальнаяТаблица <> ВыбранноеЗначение Тогда
		Если КоличествоРеквизитов <> 0 ИЛИ КоличествоПараметров <> 0 Тогда
			Вопрос = "Вы действительно хотите изменить виртуальную таблицу метаданных? Выбранные реквизиты очистятся!";
			ЗадатьВопрос(Вопрос, ВыбранноеЗначение, "Виртуальная");
		Иначе
			ВиртуальнаяТаблица = ВыбранноеЗначение;
			ВиртуальнаяТаблицаПриИзменении(Элемент);
		КонецЕсли;
	Иначе
		ВиртуальнаяТаблица = ВыбранноеЗначение;
	КонецЕсли;;
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопрос(Вопрос, ВыбранноеЗначение, Вид)
	Настройки = Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение);
	Настройки.Вставить("Вид", Вид);
	Оповещение = Новый ОписаниеОповещения("ОбработкаОтветаНаВопрос", ЭтотОбъект, Настройки);
	ПоказатьВопрос(Оповещение, Вопрос, РежимДиалогаВопрос.ДаНет, , , "Редактирование объекта метаданных");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаНаВопрос(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		КоличествоРеквизитов = Элементы.ГруппаВыбрать.ПодчиненныеЭлементы.Количество();
		КоличествоПараметров = Элементы.ГруппаГде.ПодчиненныеЭлементы.Количество();
		
		
		Пока КоличествоРеквизитов - 1 >= 0  Цикл
			КоличествоРеквизитов = КоличествоРеквизитов - 1;
			Элемент = Элементы.ГруппаВыбрать.ПодчиненныеЭлементы.Получить(КоличествоРеквизитов).Имя;
			УдалитьРеквизит(Элемент);
		КонецЦикла;
		
		Пока КоличествоПараметров - 1 >= 0  Цикл
			КоличествоПараметров = КоличествоПараметров - 1;
			Элемент = Элементы.ГруппаГде.ПодчиненныеЭлементы.Получить(КоличествоПараметров).Имя;
			УдалитьПараметр(Элемент);
		КонецЦикла;
		
		Если ДополнительныеПараметры.Вид = "Тип" Тогда
			ТипМетаданных = ДополнительныеПараметры.ВыбранноеЗначение;
			ТипМетаданныхПриИзменении(Элементы.ПолеТипМетаданных);
		ИначеЕсли ДополнительныеПараметры.Вид = "Виртуальная" Тогда
			ВиртуальнаяТаблица = ДополнительныеПараметры.ВыбранноеЗначение;
			ВиртуальнаяТаблицаПриИзменении(Элементы.ПолеВиртуальнаяТаблица);
		Иначе
			ОбъектМетаданных = ДополнительныеПараметры.ВыбранноеЗначение;
			ПолеОбъектМетаданныхПриИзменении(Элементы.ПолеОбъектМетаданных);

		КонецЕсли;
				
	КонецЕсли;
КонецПроцедуры


#КонецОбласти 

#Область РаботаСДанными

&НаКлиенте
Процедура ЗаполнитьПоляДанных(ТипДанных, НазваниеПоля, ВидРеквизита, НазваниеЭлементаВидимости) 
	Данные = Реквизиты(ОбъектМетаданных, ТипМетаданных, ТипДанных);
	КоличествоДанных = Данные.Количество();
	ЭлементВидимости = Элементы.Найти(НазваниеЭлементаВидимости);
	ЭтоГруппа = СтрНайти(НазваниеЭлементаВидимости, "Группа");
	Если КоличествоДанных = 0 Тогда
		Если ЭтоГруппа <> 0 Тогда
			ЭлементВидимости.Видимость = Ложь;
		Иначе
			ЭлементВидимости.Доступность = Ложь;
		КонецЕсли;
	Иначе
		Если ЭтоГруппа <> 0 Тогда
			ЭлементВидимости.Видимость = Истина;
		Иначе
			ЭлементВидимости.Доступность = Истина;
		КонецЕсли;
		Элементы.ПолеПараметрЗапроса.Доступность = Истина;

		Для каждого Реквизит из Данные Цикл
			ЭлементФормы = Элементы.Найти(НазваниеПоля);
			ЭлементФормы.СписокВыбора.Добавить(Реквизит.Значение);
			Элементы.ПолеПараметрЗапроса.СписокВыбора.Добавить(Реквизит.Значение);
			ВидДанных.Добавить(Реквизит.Значение, ВидРеквизита);	
		КонецЦикла
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПолеВиртуальнойТаблицы()
	ВиртуальныеТаблицы = ВиртуальныеТаблицы(ТипМетаданных);
	Для каждого Таблица Из ВиртуальныеТаблицы Цикл		
		Элементы.ПолеВиртуальнаяТаблица.СписокВыбора.Добавить(Таблица);			
	КонецЦикла;
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьПолеОбъекта()
	ОбъектыМетаданных = ОбъектМетаданных(ТипМетаданных);
	Для каждого ОбъектМетаданных из ОбъектыМетаданных Цикл
		Элементы.ПолеОбъектМетаданных.СписокВыбора.Добавить(Строка(ОбъектМетаданных));
	КонецЦикла;
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьРесурсыПоВиртуальнойТаблице(Ресурс) 
	Если ВиртуальнаяТаблица = "Остаток" ИЛИ ВиртуальнаяТаблица = "Оборот" Тогда
		Значение = Ресурс.Значение + ВиртуальнаяТаблица;
		Элементы.ПолеРесурс.СписокВыбора.Добавить(Значение);
		Элементы.ПолеПараметрЗапроса.СписокВыбора.Добавить(Значение);
		ВидДанных.Добавить(Значение, "Ресурс");
	ИначеЕсли ВиртуальнаяТаблица = "ОстаткиИОбороты" Тогда
		Начало = "НачальныйОстаток";
		Приход = "Приход";
		Расход = "Расход";
		Конец = "КонечныйОстаток";
										
		Значение = Ресурс.Значение + Начало;
		Элементы.ПолеРесурс.СписокВыбора.Добавить(Значение);
		Элементы.ПолеПараметрЗапроса.СписокВыбора.Добавить(Значение);
		ВидДанных.Добавить(Значение, "Ресурс");
										
		Значение = Ресурс.Значение + Приход;
		Элементы.ПолеРесурс.СписокВыбора.Добавить(Значение);
		Элементы.ПолеПараметрЗапроса.СписокВыбора.Добавить(Значение);
		ВидДанных.Добавить(Значение, "Ресурс");
										
		Значение = Ресурс.Значение + Расход;
		Элементы.ПолеРесурс.СписокВыбора.Добавить(Значение);
		Элементы.ПолеПараметрЗапроса.СписокВыбора.Добавить(Значение);
		ВидДанных.Добавить(Значение, "Ресурс");
										
		Значение = Ресурс.Значение + Конец;
		Элементы.ПолеРесурс.СписокВыбора.Добавить(Значение);
		Элементы.ПолеПараметрЗапроса.СписокВыбора.Добавить(Значение);
		ВидДанных.Добавить(Значение, "Ресурс");
	Иначе	
		Элементы.ПолеРесурс.СписокВыбора.Добавить(Ресурс.Значение);
		Элементы.ПолеПараметрЗапроса.СписокВыбора.Добавить(Ресурс.Значение);
		ВидДанных.Добавить(Ресурс.Значение, "Ресурс");	
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьПолеВидАгрегации(НазваниеПоля, ТипРеквизита)
	
	ЭлементФормы = Элементы.Найти(НазваниеПоля);
	Если ТипРеквизита = "Число" Тогда
		ЭлементФормы.СписокВыбора.Добавить("СУММА");
		ЭлементФормы.СписокВыбора.Добавить("СРЕДНЕЕ");
	КонецЕсли;
		
	ЭлементФормы.СписокВыбора.Добавить("КОЛИЧЕСТВО");
	ЭлементФормы.СписокВыбора.Добавить("МИНИМУМ");
	ЭлементФормы.СписокВыбора.Добавить("МАКСИМУМ");
КонецПроцедуры

&НаСервере
Функция ОбъектМетаданных(ТипМетаданных)
	ОбъектОтчета = РеквизитФормыВЗначение("Объект");
	ОбъектыМетаданных = ОбъектОтчета.ОбъектыМетаданных(ТипМетаданных); 
	Возврат ОбъектыМетаданных;
КонецФункции

&НаСервере
Функция ВиртуальныеТаблицы(ТипМетаданных)
	ВиртуальныеТаблицы = Новый Массив;	
	Если ТипМетаданных = "Регистр накопления" Тогда
		ВиртуальныеТаблицы.Добавить("Остаток");
		ВиртуальныеТаблицы.Добавить("Оборот");
		ВиртуальныеТаблицы.Добавить("ОстаткиИОбороты");
	ИначеЕсли ТипМетаданных = "Регистр сведений" Тогда
		ВиртуальныеТаблицы.Добавить("СрезПоследних");
		ВиртуальныеТаблицы.Добавить("СрезПервых");
	КонецЕсли;
	Возврат ВиртуальныеТаблицы;
		
КонецФункции

&НаСервере
Функция Реквизиты(СтроковыйОбъектМетаданных, Тип, Вид)
	ОбъектОтчета = РеквизитФормыВЗначение("Объект");
	Реквизиты = ОбъектОтчета.РеквизитыОбъектаМетаданных(ТипМетаданных, СтроковыйОбъектМетаданных, Тип, Вид);
	Возврат Реквизиты;                                             

КонецФункции



&НаСервере
Функция ТипРеквизита(Название, Вид)
	ОбъектОтчета = РеквизитФормыВЗначение("Объект");
	ТипРеквизита = ОбъектОтчета.НайтиТипПараметра(Название, ОбъектМетаданных, Вид);
	Возврат ТипРеквизита;
КонецФункции




#КонецОбласти

#Область ФормированиеОтчета

&НаКлиенте
Процедура СформироватьОтчет()
	
	РеквизитыДляОтчета = РеквизитыДляОтчета();
	ПараметрыДляОтчета = ПараметрыДляОтчета();
	ГруппировкиДляОтчета = ГруппировкиДляОтчета();
	ИтогиПоДляОтчета = ИтогиПоДляОтчета();
	ПорядокДляОтчета = УпордочитьПоДляОтчета();
	ДатаРегистра = ДатаРегистраДляОтчета(); 
	
	Результат = ОтчетВМодуле(
		ТипМетаданных, 
		ОбъектМетаданных, 
		РеквизитыДляОтчета, 
		ГруппировкиДляОтчета, 
		ПараметрыДляОтчета, 
		Итоги, 
		ИтогиПоДляОтчета, 
		ПорядокДляОтчета, 
		ВиртуальнаяТаблица, 
		ДатаРегистра
	);
	
	Если Результат.Получить("ТабличныйДокумент") <> Неопределено Тогда
		ТабличныйДокумент = Результат.Получить("ТабличныйДокумент");
	Иначе
		ПоказатьПредупреждение(, Строка(Результат.Получить("Ошибка")), 30);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтчетВМодуле(
	ТипМетаданных, 
	ОбъектМетаданных, 
	Реквизиты, 
	Группировки, 
	Параметры, 
	Итоги, 
	ИтогиПо, 
	Порядок,
	ВиртуальнаяТаблица,
	ДатаРегистра
)
	ОбъектОтчет = РеквизитФормыВЗначение("Объект");
	Результат = ОбъектОтчет.СформироватьОтчет(
		ТипМетаданных, 
		ОбъектМетаданных, 
		Реквизиты, 
		Группировки, 
		Параметры, 
		Итоги, 
		ИтогиПо, 
		Порядок, 
		ВиртуальнаяТаблица, 
		ДатаРегистра
	);
	Возврат Результат; 

КонецФункции


&НаКлиенте
Функция РеквизитыДляОтчета()
	Реквизиты = Новый Массив;
	КоличествоРеквизитов = Элементы.ГруппаВыбрать.ПодчиненныеЭлементы.Количество();
	Если КоличествоРеквизитов <> 0 Тогда
		Пока КоличествоРеквизитов - 1 >= 0  Цикл
			КоличествоРеквизитов = КоличествоРеквизитов - 1;
			Элемент = Элементы.ГруппаВыбрать.ПодчиненныеЭлементы.Получить(КоличествоРеквизитов).Заголовок;
			ЕслиЛиВиртуальнаяТаблица = Элементы.ГруппаВыбрать.ПодчиненныеЭлементы.Получить(КоличествоРеквизитов).Подсказка;
			Если НЕ ЗначениеЗаполнено(ЕслиЛиВиртуальнаяТаблица) Тогда	
				ЕслиЛиВиртуальнаяТаблица = Неопределено;
			КонецЕсли;
			ЕстьЛиАгрегация = Найти(Элемент, "(");                          
			Если ЕстьЛиАгрегация > 0 Тогда
				Позиция = СтрНайти(Элемент, "(");
				Если ЕслиЛиВиртуальнаяТаблица <> Неопределено Тогда
					ВставляемаяСтрока = ОбъектМетаданных+"."+ЕслиЛиВиртуальнаяТаблица+".";
				Иначе
					ВставляемаяСтрока = ОбъектМетаданных+".";
				КонецЕсли;
					
				Строка = Лев(Элемент, Позиция) + ВставляемаяСтрока + Сред(Элемент, Позиция + 1);
			Иначе
				Если ЕслиЛиВиртуальнаяТаблица <> Неопределено Тогда
					Строка = ОбъектМетаданных+"."+ЕслиЛиВиртуальнаяТаблица+"."+Элемент; 	
				Иначе
					Строка = ОбъектМетаданных+"."+Элемент;
				КонецЕсли;
			КонецЕсли;	
			Реквизиты.Добавить(Строка);
		КонецЦикла;
		Возврат Реквизиты;
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Функция ПараметрыДляОтчета()
	ПараметрыДляОтчета = Новый Массив;	
	Если ЗначенияПараметров.Количество() <> 0 Тогда
		
		Для каждого Параметр из ЗначенияПараметров Цикл
			ИмяЗначениеПараметров = Новый Соответствие;
			ПолноеНазваниеПараметра = ОбъектМетаданных + "." + Параметр.Представление;
			ЗначениеПараметра = Параметр.Значение;
			ИмяЗначениеПараметров.Вставить(ПолноеНазваниеПараметра, ЗначениеПараметра);
			ПараметрыДляОтчета.Добавить(ИмяЗначениеПараметров);
		КонецЦикла;
	КонецЕсли;
	Возврат ПараметрыДляОтчета;
КонецФункции 

&НаКлиенте
Функция ГруппировкиДляОтчета()
	
	Группировки = Новый Массив;
	КоличествоГруппировок = Элементы.ГруппаСгруппироватьПо.ПодчиненныеЭлементы.Количество();
	Если КоличествоГруппировок <> 0 Тогда
		Пока КоличествоГруппировок - 1 >= 0  Цикл
			КоличествоГруппировок = КоличествоГруппировок - 1;
			Элемент = Элементы.ГруппаСгруппироватьПо.ПодчиненныеЭлементы.Получить(КоличествоГруппировок).Заголовок;
			ЕстьЛиВиртуальнаяТаблица = Элементы.ГруппаСгруппироватьПо.ПодчиненныеЭлементы.Получить(КоличествоГруппировок).Подсказка;
			Если НЕ ЗначениеЗаполнено(ЕстьЛиВиртуальнаяТаблица) Тогда	
				ЕстьЛиВиртуальнаяТаблица = Неопределено;
			КонецЕсли;
				
			Если ЕстьЛиВиртуальнаяТаблица <> Неопределено Тогда
				Строка = ОбъектМетаданных + "." + ЕстьЛиВиртуальнаяТаблица + "." + Элемент; 	
			Иначе
				Строка = ОбъектМетаданных + "." + Элемент;
			КонецЕсли;

			Группировки.Добавить(Строка);
		КонецЦикла;
	КонецЕсли;
	Возврат Группировки;
	
КонецФункции

&НаКлиенте
Функция ИтогиПоДляОтчета()
	
	ИтогиПоДляОтчета = Новый Массив;
	КоличествоИтогов = Элементы.ГруппаПо.ПодчиненныеЭлементы.Количество();
	Если КоличествоИтогов <> 0 Тогда
		
		Пока КоличествоИтогов - 1 >= 0  Цикл
			КоличествоИтогов = КоличествоИтогов - 1;
			Элемент = Элементы.ГруппаПо.ПодчиненныеЭлементы.Получить(КоличествоИтогов).Заголовок;
			ЕстьЛиВиртуальнаяТаблица = Элементы.ГруппаПо.ПодчиненныеЭлементы.Получить(КоличествоИтогов).Подсказка;
			Если НЕ ЗначениеЗаполнено(ЕстьЛиВиртуальнаяТаблица) Тогда	
				ЕстьЛиВиртуальнаяТаблица = Неопределено;
			КонецЕсли;
				
			Если ЕстьЛиВиртуальнаяТаблица <> Неопределено Тогда
				Строка = ОбъектМетаданных + "." + ЕстьЛиВиртуальнаяТаблица + "." + Элемент; 	
			Иначе
				Строка = ОбъектМетаданных + "." + Элемент;
			КонецЕсли;
			ИтогиПоДляОтчета.Добавить(Строка);
		КонецЦикла;
	
	КонецЕсли;
	Возврат ИтогиПоДляОтчета;
	
КонецФункции

&НаКлиенте
Функция УпордочитьПоДляОтчета() 
	
	УпорядочитьПоДляОтчета = Новый Массив;
	КоличествоПорядков = Элементы.ГруппаУпорядочитьПо.ПодчиненныеЭлементы.Количество();
	Если КоличествоПорядков <> 0 Тогда
		
		Пока КоличествоПорядков - 1 >= 0  Цикл
			КоличествоПорядков = КоличествоПорядков - 1;
			Элемент = Элементы.ГруппаУпорядочитьПо.ПодчиненныеЭлементы.Получить(КоличествоПорядков).Заголовок;
			ЕстьЛиВиртуальнаяТаблица = Элементы.ГруппаУпорядочитьПо.ПодчиненныеЭлементы.Получить(КоличествоПорядков).Подсказка;
			Если НЕ ЗначениеЗаполнено(ЕстьЛиВиртуальнаяТаблица) Тогда	
				ЕстьЛиВиртуальнаяТаблица = Неопределено;
			КонецЕсли;
				
			Если ЕстьЛиВиртуальнаяТаблица <> Неопределено Тогда
				Строка = ОбъектМетаданных + "." + ЕстьЛиВиртуальнаяТаблица + "." + Элемент; 	
			Иначе
				Строка = ОбъектМетаданных + "." + Элемент;
			КонецЕсли;
			УпорядочитьПоДляОтчета.Добавить(Строка);
		КонецЦикла;
	
	КонецЕсли;
	Возврат УпорядочитьПоДляОтчета;
	
КонецФункции

&НаКлиенте
Функция ДатаРегистраДляОтчета()
	ДатаРегистра = Новый Массив;
	Если ЗначениеЗаполнено(РегистрНачало) Тогда
		ДатаРегистра.Добавить(РегистрНачало);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РегистрКонец) Тогда
		ДатаРегистра.Добавить(РегистрКонец);
	КонецЕсли;
	
	Возврат ДатаРегистра;
КонецФункции

#КонецОбласти

 #Область ВспомогательныеФункции
                                        
&НаСервере                                                                                        
Функция СтрокаБезСкобок(Строка)
	ПозицияПервойСкобки = СтрНайти(Строка, "(");
	СтрокаБезПервойСкобки = Сред(Строка, ПозицияПервойСкобки + 1); 
	ПозицияВторойСкобки = СтрНайти(СтрокаБезПервойСкобки, ")");
	СтрокаБезСкобок = Сред(Строка, ПозицияПервойСкобки + 1, ПозицияВторойСкобки - 1); 
	Возврат СтрокаБезСкобок;
	                                                                                                      
КонецФункции                                                                                              

&НаСервере
Функция ЗначениеРеквизитаПоНазванию(ПутьКДанным)
	Реквизиты = ПолучитьРеквизиты();
	Для Каждого Реквизит из Реквизиты Цикл
		Если Реквизит.Имя = ПутьКДанным Тогда
			Возврат ЭтотОбъект[Реквизит.Имя];
		КонецЕсли;
	КонецЦикла;	
КонецФункции

&НаСервере
Функция РесурсБезСуффикса(РесурсОбъектаМетаданных, ВиртуальнаяТаблица)
	
	Если ВиртуальнаяТаблица = "Остаток" Тогда
		Результат = Лев(РесурсОбъектаМетаданных, СтрДлина(РесурсОбъектаМетаданных) - 7);
	ИначеЕсли ВиртуальнаяТаблица = "Оборот" Тогда
		Результат = Лев(РесурсОбъектаМетаданных, СтрДлина(РесурсОбъектаМетаданных) - 6);
	ИначеЕсли  ВиртуальнаяТаблица = "ОстаткиИОбороты" Тогда
		Если Прав(РесурсОбъектаМетаданных, 16) = "НачальныйОстаток" Тогда
			Результат = Лев(РесурсОбъектаМетаданных, СтрДлина(РесурсОбъектаМетаданных) - 16);
		ИначеЕсли Прав(РесурсОбъектаМетаданных, 6) = "Приход" Тогда
			Результат = Лев(РесурсОбъектаМетаданных, СтрДлина(РесурсОбъектаМетаданных) - 6);
		ИначеЕсли Прав(РесурсОбъектаМетаданных, 6) = "Расход" Тогда
			Результат = Лев(РесурсОбъектаМетаданных, СтрДлина(РесурсОбъектаМетаданных) - 6);
		ИначеЕсли Прав(РесурсОбъектаМетаданных, 15) = "КонечныйОстаток" Тогда
			Результат = Лев(РесурсОбъектаМетаданных, СтрДлина(РесурсОбъектаМетаданных) - 15);
		Иначе
			Возврат РесурсОбъектаМетаданных;
		КонецЕсли;
	Иначе
		Возврат РесурсОбъектаМетаданных; 
	КонецЕсли;
	
	Возврат Результат;
КонецФункции


&НаСервере
Функция ТипДанныхРеквизита(Название, ОбъектМетаданных, ВиртуальнаяТаблица = "")
	Если Элементы.ПолеРеквизит.СписокВыбора.НайтиПоЗначению(Название) <> Неопределено Тогда
		Возврат "Реквизит";
	КонецЕсли;
	Возврат "Измерение";
КонецФункции


#КонецОбласти 

	